stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =========================================================================================================================== */
/* ================                                            RNG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Random number generator (RNG)
  */

typedef struct                                  /*!< RNG Structure                                                             */
{
  __IO uint32_t  CR;                           /*!< (@ 0x00000000) Control register                                           */
  __IO uint32_t  SR;                           /*!< (@ 0x00000004) Status register                                            */
  __IO uint32_t  VAL;                          /*!< (@ 0x00000008) Data register                                              */
} RNG_TypeDef;                                  /*!< Size = 12 (0xC)                                                           */


/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIO)
  */

typedef struct                                  /*!< GPIO Structure                                                            */
{
  __IO uint32_t  MODER;                        /*!< (@ 0x00000000) GPIO port mode register                                    */
  __IO uint32_t  OTYPER;                       /*!< (@ 0x00000004) GPIO port output type register                             */
  __IO uint32_t  OSPEEDR;                      /*!< (@ 0x00000008) GPIO port output speed register                            */
  __IO uint32_t  PUPDR;                        /*!< (@ 0x0000000C) GPIO port pull-up/pull-down register                       */
  __IO uint32_t  IDR;                          /*!< (@ 0x00000010) GPIO port input data register                              */
  __IO uint32_t  ODR;                          /*!< (@ 0x00000014) GPIO port output data register                             */
  __IO uint32_t  BSRR;                         /*!< (@ 0x00000018) GPIO port bit set/reset register                           */
  __IO uint32_t  LCKR;                         /*!< (@ 0x0000001C) GPIO port configuration lock register                      */
  __IO uint32_t  AFR[2];                       /*!< (@ 0x00000020) GPIO alternate function register                           */
  __IO uint32_t  BRR;                          /*!< (@ 0x00000028) GPIO bit reset register                                    */
} GPIO_TypeDef;                                 /*!< Size = 44 (0x2c)                                                          */


/* =========================================================================================================================== */
/* ================                                            TIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced-timers (TIM)
  */

typedef struct                                  /*!< TIM Structure                                                             */
{
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  SMCR;                         /*!< (@ 0x00000008) Slave mode control register                                */
  __IO uint32_t  DIER;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
  __IO uint32_t  SR;                           /*!< (@ 0x00000010) Status register                                            */
  __IO uint32_t  EGR;                          /*!< (@ 0x00000014) Event generation register                                  */
  __IO uint32_t  CCMR1;                        /*!< (@ 0x00000018) Input capture and output compare mode register 1           */
  __IO uint32_t  CCMR2;                        /*!< (@ 0x0000001C) Input capture and output compare mode register 2           */
  __IO uint32_t  CCER;                         /*!< (@ 0x00000020) Capture/compare enable register                            */
  __IO uint32_t  CNT;                          /*!< (@ 0x00000024) Counter                                                    */
  __IO uint32_t  PSC;                          /*!< (@ 0x00000028) Prescaler                                                  */
  __IO uint32_t  ARR;                          /*!< (@ 0x0000002C) Auto-reload register                                       */
  __IO uint32_t  RCR;                          /*!< (@ 0x00000030) Repetition counter register                                */
  __IO uint32_t  CCR1;                         /*!< (@ 0x00000034) Capture/compare register 1                                 */
  __IO uint32_t  CCR2;                         /*!< (@ 0x00000038) Capture/compare register 2                                 */
  __IO uint32_t  CCR3;                         /*!< (@ 0x0000003C) Capture/compare register 3                                 */
  __IO uint32_t  CCR4;                         /*!< (@ 0x00000040) Capture/compare register 4                                 */
  __IO uint32_t  BDTR;                         /*!< (@ 0x00000044) Break and dead-time register                               */
  __IO uint32_t  DCR;                          /*!< (@ 0x00000048) DMA control register                                       */
  __IO uint32_t  DMAR;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */
  __IO uint32_t  OR1;                          /*!< (@ 0x00000050) Option register 1                                          */
  __IO uint32_t  RESERVED[3];
  __IO uint32_t  AF1;                          /*!< (@ 0x00000060) TIM alternate function option register 1                   */
} TIM_TypeDef;                                  /*!< Size = 100 (0x64)                                                         */


/* =========================================================================================================================== */
/* ================                                           USART                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver transmitter (USART)
  */

typedef struct                                  /*!< USART/LPUART Structure                                                    */
{
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  CR3;                          /*!< (@ 0x00000008) Control register 3                                         */
  __IO uint32_t  BRR;                          /*!< (@ 0x0000000C) Baud rate register                                         */
  __IO uint32_t  GTPR;                         /*!< (@ 0x00000010) Guard time and prescaler register                          */
  __IO uint32_t  RTOR;                         /*!< (@ 0x00000014) Receiver timeout register                                  */
  __IO uint32_t  RQR;                          /*!< (@ 0x00000018) Request register                                           */
  __IO uint32_t  ISR;                          /*!< (@ 0x0000001C) Interrupt & status register                                */
  __IO uint32_t  ICR;                          /*!< (@ 0x00000020) Interrupt flag clear register                              */
  __IO uint32_t  RDR;                          /*!< (@ 0x00000024) Receive data register                                      */
  __IO uint32_t  TDR;                          /*!< (@ 0x00000028) Transmit data register                                     */
  __IO uint32_t  PRESC;                        /*!< (@ 0x0000002C) Prescaler register                                         */
} USART_TypeDef;                                /*!< Size = 48 (0x30)                                                          */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct                                  /*!< RTC Structure                                                             */
{
  __IO uint32_t  TR;                           /*!< (@ 0x00000000) Time register                                              */
  __IO uint32_t  DR;                           /*!< (@ 0x00000004) Date register                                              */
  __IO uint32_t  CR;                           /*!< (@ 0x00000008) Control register                                           */
  __IO uint32_t  ISR;                          /*!< (@ 0x0000000C) Initialization and status register                         */
  __IO uint32_t  PRER;                         /*!< (@ 0x00000010) Prescaler register                                         */
  __IO uint32_t  WUTR;                         /*!< (@ 0x00000014) Wakeup timer register                                      */
  __IO uint32_t  RESERVED;
  __IO uint32_t  ALRMAR;                       /*!< (@ 0x0000001C) Alarm A register                                           */
  __IO uint32_t  RESERVED1;
  __IO uint32_t  WPR;                          /*!< (@ 0x00000024) Write protection register                                  */
  __IO uint32_t  SSR;                          /*!< (@ 0x00000028) Sub second register                                        */
  __IO uint32_t  SHIFTR;                       /*!< (@ 0x0000002C) Shift control register                                     */
  __IO uint32_t  RESERVED2[3];
  __IO uint32_t  CALR;                         /*!< (@ 0x0000003C) Calibration register                                       */
  __IO uint32_t  RESERVED3;
  __IO uint32_t  ALRMASSR;                     /*!< (@ 0x00000044) Alarm A sub second register                                */
  __IO uint32_t  RESERVED4[2];
  __IO uint32_t  BKP0R;                        /*!< (@ 0x00000050) Backup register 0                                          */
  __IO uint32_t  BKP1R;                        /*!< (@ 0x00000054) Backup register 1                                          */
} RTC_TypeDef;                                  /*!< Size = 88 (0x58)                                                          */


/* =========================================================================================================================== */
/* ================                                            PKA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PKA (PKA)
  */

