stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    IFCR    ===================================================== */
#define DMA_IFCR_CTEIF8_Pos                                                (31UL)   /*!<DMA IFCR: CTEIF8 (Bit 31) */
#define DMA_IFCR_CTEIF8_Msk                                                (0x80000000UL)   /*!< DMA IFCR: CTEIF8 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTEIF8                                                    DMA_IFCR_CTEIF8_Msk
#define DMA_IFCR_CHTIF8_Pos                                                (30UL)   /*!<DMA IFCR: CHTIF8 (Bit 30) */
#define DMA_IFCR_CHTIF8_Msk                                                (0x40000000UL)   /*!< DMA IFCR: CHTIF8 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CHTIF8                                                    DMA_IFCR_CHTIF8_Msk
#define DMA_IFCR_CTCIF8_Pos                                                (29UL)   /*!<DMA IFCR: CTCIF8 (Bit 29) */
#define DMA_IFCR_CTCIF8_Msk                                                (0x20000000UL)   /*!< DMA IFCR: CTCIF8 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTCIF8                                                    DMA_IFCR_CTCIF8_Msk
#define DMA_IFCR_CGIF8_Pos                                                 (28UL)   /*!<DMA IFCR: CGIF8 (Bit 28) */
#define DMA_IFCR_CGIF8_Msk                                                 (0x10000000UL)   /*!< DMA IFCR: CGIF8 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CGIF8                                                     DMA_IFCR_CGIF8_Msk
#define DMA_IFCR_CTEIF7_Pos                                                (27UL)   /*!<DMA IFCR: CTEIF7 (Bit 27) */
#define DMA_IFCR_CTEIF7_Msk                                                (0x8000000UL)    /*!< DMA IFCR: CTEIF7 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTEIF7                                                    DMA_IFCR_CTEIF7_Msk
#define DMA_IFCR_CHTIF7_Pos                                                (26UL)   /*!<DMA IFCR: CHTIF7 (Bit 26) */
#define DMA_IFCR_CHTIF7_Msk                                                (0x4000000UL)    /*!< DMA IFCR: CHTIF7 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CHTIF7                                                    DMA_IFCR_CHTIF7_Msk
#define DMA_IFCR_CTCIF7_Pos                                                (25UL)   /*!<DMA IFCR: CTCIF7 (Bit 25) */
#define DMA_IFCR_CTCIF7_Msk                                                (0x2000000UL)    /*!< DMA IFCR: CTCIF7 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTCIF7                                                    DMA_IFCR_CTCIF7_Msk
#define DMA_IFCR_CGIF7_Pos                                                 (24UL)   /*!<DMA IFCR: CGIF7 (Bit 24) */
#define DMA_IFCR_CGIF7_Msk                                                 (0x1000000UL)    /*!< DMA IFCR: CGIF7 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CGIF7                                                     DMA_IFCR_CGIF7_Msk
#define DMA_IFCR_CTEIF6_Pos                                                (23UL)   /*!<DMA IFCR: CTEIF6 (Bit 23) */
#define DMA_IFCR_CTEIF6_Msk                                                (0x800000UL)   /*!< DMA IFCR: CTEIF6 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTEIF6                                                    DMA_IFCR_CTEIF6_Msk
#define DMA_IFCR_CHTIF6_Pos                                                (22UL)   /*!<DMA IFCR: CHTIF6 (Bit 22) */
#define DMA_IFCR_CHTIF6_Msk                                                (0x400000UL)   /*!< DMA IFCR: CHTIF6 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CHTIF6                                                    DMA_IFCR_CHTIF6_Msk
#define DMA_IFCR_CTCIF6_Pos                                                (21UL)   /*!<DMA IFCR: CTCIF6 (Bit 21) */
#define DMA_IFCR_CTCIF6_Msk                                                (0x200000UL)   /*!< DMA IFCR: CTCIF6 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTCIF6                                                    DMA_IFCR_CTCIF6_Msk
#define DMA_IFCR_CGIF6_Pos                                                 (20UL)   /*!<DMA IFCR: CGIF6 (Bit 20) */
#define DMA_IFCR_CGIF6_Msk                                                 (0x100000UL)   /*!< DMA IFCR: CGIF6 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CGIF6                                                     DMA_IFCR_CGIF6_Msk
#define DMA_IFCR_CTEIF5_Pos                                                (19UL)   /*!<DMA IFCR: CTEIF5 (Bit 19) */
#define DMA_IFCR_CTEIF5_Msk                                                (0x80000UL)    /*!< DMA IFCR: CTEIF5 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTEIF5                                                    DMA_IFCR_CTEIF5_Msk
#define DMA_IFCR_CHTIF5_Pos                                                (18UL)   /*!<DMA IFCR: CHTIF5 (Bit 18) */
#define DMA_IFCR_CHTIF5_Msk                                                (0x40000UL)    /*!< DMA IFCR: CHTIF5 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CHTIF5                                                    DMA_IFCR_CHTIF5_Msk
#define DMA_IFCR_CTCIF5_Pos                                                (17UL)   /*!<DMA IFCR: CTCIF5 (Bit 17) */
#define DMA_IFCR_CTCIF5_Msk                                                (0x20000UL)    /*!< DMA IFCR: CTCIF5 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTCIF5                                                    DMA_IFCR_CTCIF5_Msk
#define DMA_IFCR_CGIF5_Pos                                                 (16UL)   /*!<DMA IFCR: CGIF5 (Bit 16) */
#define DMA_IFCR_CGIF5_Msk                                                 (0x10000UL)    /*!< DMA IFCR: CGIF5 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CGIF5                                                     DMA_IFCR_CGIF5_Msk
#define DMA_IFCR_CTEIF4_Pos                                                (15UL)   /*!<DMA IFCR: CTEIF4 (Bit 15) */
#define DMA_IFCR_CTEIF4_Msk                                                (0x8000UL)   /*!< DMA IFCR: CTEIF4 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTEIF4                                                    DMA_IFCR_CTEIF4_Msk
#define DMA_IFCR_CHTIF4_Pos                                                (14UL)   /*!<DMA IFCR: CHTIF4 (Bit 14) */
#define DMA_IFCR_CHTIF4_Msk                                                (0x4000UL)   /*!< DMA IFCR: CHTIF4 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CHTIF4                                                    DMA_IFCR_CHTIF4_Msk
#define DMA_IFCR_CTCIF4_Pos                                                (13UL)   /*!<DMA IFCR: CTCIF4 (Bit 13) */
#define DMA_IFCR_CTCIF4_Msk                                                (0x2000UL)   /*!< DMA IFCR: CTCIF4 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTCIF4                                                    DMA_IFCR_CTCIF4_Msk
#define DMA_IFCR_CGIF4_Pos                                                 (12UL)   /*!<DMA IFCR: CGIF4 (Bit 12) */
#define DMA_IFCR_CGIF4_Msk                                                 (0x1000UL)   /*!< DMA IFCR: CGIF4 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CGIF4                                                     DMA_IFCR_CGIF4_Msk
#define DMA_IFCR_CTEIF3_Pos                                                (11UL)   /*!<DMA IFCR: CTEIF3 (Bit 11) */
#define DMA_IFCR_CTEIF3_Msk                                                (0x800UL)    /*!< DMA IFCR: CTEIF3 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTEIF3                                                    DMA_IFCR_CTEIF3_Msk
#define DMA_IFCR_CHTIF3_Pos                                                (10UL)   /*!<DMA IFCR: CHTIF3 (Bit 10) */
#define DMA_IFCR_CHTIF3_Msk                                                (0x400UL)    /*!< DMA IFCR: CHTIF3 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CHTIF3                                                    DMA_IFCR_CHTIF3_Msk
#define DMA_IFCR_CTCIF3_Pos                                                (9UL)    /*!<DMA IFCR: CTCIF3 (Bit 9) */
#define DMA_IFCR_CTCIF3_Msk                                                (0x200UL)    /*!< DMA IFCR: CTCIF3 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTCIF3                                                    DMA_IFCR_CTCIF3_Msk
#define DMA_IFCR_CGIF3_Pos                                                 (8UL)    /*!<DMA IFCR: CGIF3 (Bit 8) */
#define DMA_IFCR_CGIF3_Msk                                                 (0x100UL)    /*!< DMA IFCR: CGIF3 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CGIF3                                                     DMA_IFCR_CGIF3_Msk
#define DMA_IFCR_CTEIF2_Pos                                                (7UL)    /*!<DMA IFCR: CTEIF2 (Bit 7) */
#define DMA_IFCR_CTEIF2_Msk                                                (0x80UL)   /*!< DMA IFCR: CTEIF2 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTEIF2                                                    DMA_IFCR_CTEIF2_Msk
#define DMA_IFCR_CHTIF2_Pos                                                (6UL)    /*!<DMA IFCR: CHTIF2 (Bit 6) */
#define DMA_IFCR_CHTIF2_Msk                                                (0x40UL)   /*!< DMA IFCR: CHTIF2 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CHTIF2                                                    DMA_IFCR_CHTIF2_Msk
#define DMA_IFCR_CTCIF2_Pos                                                (5UL)    /*!<DMA IFCR: CTCIF2 (Bit 5) */
#define DMA_IFCR_CTCIF2_Msk                                                (0x20UL)   /*!< DMA IFCR: CTCIF2 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTCIF2                                                    DMA_IFCR_CTCIF2_Msk
#define DMA_IFCR_CGIF2_Pos                                                 (4UL)    /*!<DMA IFCR: CGIF2 (Bit 4) */
#define DMA_IFCR_CGIF2_Msk                                                 (0x10UL)   /*!< DMA IFCR: CGIF2 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CGIF2                                                     DMA_IFCR_CGIF2_Msk
#define DMA_IFCR_CTEIF1_Pos                                                (3UL)    /*!<DMA IFCR: CTEIF1 (Bit 3) */
#define DMA_IFCR_CTEIF1_Msk                                                (0x8UL)    /*!< DMA IFCR: CTEIF1 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTEIF1                                                    DMA_IFCR_CTEIF1_Msk
#define DMA_IFCR_CHTIF1_Pos                                                (2UL)    /*!<DMA IFCR: CHTIF1 (Bit 2) */
#define DMA_IFCR_CHTIF1_Msk                                                (0x4UL)    /*!< DMA IFCR: CHTIF1 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CHTIF1                                                    DMA_IFCR_CHTIF1_Msk
#define DMA_IFCR_CTCIF1_Pos                                                (1UL)    /*!<DMA IFCR: CTCIF1 (Bit 1) */
#define DMA_IFCR_CTCIF1_Msk                                                (0x2UL)    /*!< DMA IFCR: CTCIF1 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CTCIF1                                                    DMA_IFCR_CTCIF1_Msk
#define DMA_IFCR_CGIF1_Pos                                                 (0UL)    /*!<DMA IFCR: CGIF1 (Bit 0) */
#define DMA_IFCR_CGIF1_Msk                                                 (0x1UL)    /*!< DMA IFCR: CGIF1 (Bitfield-Mask: 0x01) */
#define DMA_IFCR_CGIF1                                                     DMA_IFCR_CGIF1_Msk

/* =====================================================    CCR    ===================================================== */
#define DMA_CCR_MEM2MEM_Pos                                                (14UL)   /*!<DMA CCR: MEM2MEM (Bit 14) */
#define DMA_CCR_MEM2MEM_Msk                                                (0x4000UL)   /*!< DMA CCR: MEM2MEM (Bitfield-Mask: 0x01) */
#define DMA_CCR_MEM2MEM                                                    DMA_CCR_MEM2MEM_Msk
#define DMA_CCR_PL_Pos                                                     (12UL)   /*!<DMA CCR: PL (Bit 12) */
#define DMA_CCR_PL_Msk                                                     (0x3000UL)   /*!< DMA CCR: PL (Bitfield-Mask: 0x03) */
#define DMA_CCR_PL                                                         DMA_CCR_PL_Msk
#define DMA_CCR_PL_0                                                       (0x1U << DMA_CCR_PL_Pos)
#define DMA_CCR_PL_1                                                       (0x2U << DMA_CCR_PL_Pos)
#define DMA_CCR_MSIZE_Pos                                                  (10UL)   /*!<DMA CCR: MSIZE (Bit 10) */
#define DMA_CCR_MSIZE_Msk                                                  (0xc00UL)    /*!< DMA CCR: MSIZE (Bitfield-Mask: 0x03) */
#define DMA_CCR_MSIZE                                                      DMA_CCR_MSIZE_Msk
#define DMA_CCR_MSIZE_0                                                    (0x1U << DMA_CCR_MSIZE_Pos)
#define DMA_CCR_MSIZE_1                                                    (0x2U << DMA_CCR_MSIZE_Pos)
#define DMA_CCR_PSIZE_Pos                                                  (8UL)    /*!<DMA CCR: PSIZE (Bit 8) */
#define DMA_CCR_PSIZE_Msk                                                  (0x300UL)    /*!< DMA CCR: PSIZE (Bitfield-Mask: 0x03) */
#define DMA_CCR_PSIZE                                                      DMA_CCR_PSIZE_Msk
#define DMA_CCR_PSIZE_0                                                    (0x1U << DMA_CCR_PSIZE_Pos)
#define DMA_CCR_PSIZE_1                                                    (0x2U << DMA_CCR_PSIZE_Pos)
#define DMA_CCR_MINC_Pos                                                   (7UL)    /*!<DMA CCR: MINC (Bit 7) */
#define DMA_CCR_MINC_Msk                                                   (0x80UL)   /*!< DMA CCR: MINC (Bitfield-Mask: 0x01) */
#define DMA_CCR_MINC                                                       DMA_CCR_MINC_Msk
#define DMA_CCR_PINC_Pos                                                   (6UL)    /*!<DMA CCR: PINC (Bit 6) */
#define DMA_CCR_PINC_Msk                                                   (0x40UL)   /*!< DMA CCR: PINC (Bitfield-Mask: 0x01) */
#define DMA_CCR_PINC                                                       DMA_CCR_PINC_Msk
#define DMA_CCR_CIRC_Pos                                                   (5UL)    /*!<DMA CCR: CIRC (Bit 5) */
#define DMA_CCR_CIRC_Msk                                                   (0x20UL)   /*!< DMA CCR: CIRC (Bitfield-Mask: 0x01) */
#define DMA_CCR_CIRC                                                       DMA_CCR_CIRC_Msk
#define DMA_CCR_DIR_Pos                                                    (4UL)    /*!<DMA CCR: DIR (Bit 4) */
#define DMA_CCR_DIR_Msk                                                    (0x10UL)   /*!< DMA CCR: DIR (Bitfield-Mask: 0x01) */
#define DMA_CCR_DIR                                                        DMA_CCR_DIR_Msk
#define DMA_CCR_TEIE_Pos                                                   (3UL)    /*!<DMA CCR: TEIE (Bit 3) */
#define DMA_CCR_TEIE_Msk                                                   (0x8UL)    /*!< DMA CCR: TEIE (Bitfield-Mask: 0x01) */
#define DMA_CCR_TEIE                                                       DMA_CCR_TEIE_Msk
#define DMA_CCR_HTIE_Pos                                                   (2UL)    /*!<DMA CCR: HTIE (Bit 2) */
#define DMA_CCR_HTIE_Msk                                                   (0x4UL)    /*!< DMA CCR: HTIE (Bitfield-Mask: 0x01) */
#define DMA_CCR_HTIE                                                       DMA_CCR_HTIE_Msk
#define DMA_CCR_TCIE_Pos                                                   (1UL)    /*!<DMA CCR: TCIE (Bit 1) */
#define DMA_CCR_TCIE_Msk                                                   (0x2UL)    /*!< DMA CCR: TCIE (Bitfield-Mask: 0x01) */
#define DMA_CCR_TCIE                                                       DMA_CCR_TCIE_Msk
#define DMA_CCR_EN_Pos                                                     (0UL)    /*!<DMA CCR: EN (Bit 0) */
#define DMA_CCR_EN_Msk                                                     (0x1UL)    /*!< DMA CCR: EN (Bitfield-Mask: 0x01) */
#define DMA_CCR_EN                                                         DMA_CCR_EN_Msk

/* =====================================================    CNDTR    ===================================================== */
#define DMA_CNDTR_NDT_Pos                                                  (0UL)    /*!<DMA CNDTR: NDT (Bit 0) */
#define DMA_CNDTR_NDT_Msk                                                  (0xffffUL)   /*!< DMA CNDTR: NDT (Bitfield-Mask: 0xffff) */
#define DMA_CNDTR_NDT                                                      DMA_CNDTR_NDT_Msk
#define DMA_CNDTR_NDT_0                                                    (0x1U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_1                                                    (0x2U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_2                                                    (0x4U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_3                                                    (0x8U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_4                                                    (0x10U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_5                                                    (0x20U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_6                                                    (0x40U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_7                                                    (0x80U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_8                                                    (0x100U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_9                                                    (0x200U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_10                                                   (0x400U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_11                                                   (0x800U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_12                                                   (0x1000U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_13                                                   (0x2000U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_14                                                   (0x4000U << DMA_CNDTR_NDT_Pos)
#define DMA_CNDTR_NDT_15                                                   (0x8000U << DMA_CNDTR_NDT_Pos)

/* =====================================================    CPAR    ===================================================== */
#define DMA_CPAR_PA_Pos                                                    (0UL)    /*!<DMA CPAR: PA (Bit 0) */
#define DMA_CPAR_PA_Msk                                                    (0xffffffffUL)   /*!< DMA CPAR: PA (Bitfield-Mask: 0xffffffff) */
#define DMA_CPAR_PA                                                        DMA_CPAR_PA_Msk
#define DMA_CPAR_PA_0                                                      (0x1U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_1                                                      (0x2U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_2                                                      (0x4U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_3                                                      (0x8U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_4                                                      (0x10U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_5                                                      (0x20U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_6                                                      (0x40U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_7                                                      (0x80U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_8                                                      (0x100U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_9                                                      (0x200U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_10                                                     (0x400U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_11                                                     (0x800U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_12                                                     (0x1000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_13                                                     (0x2000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_14                                                     (0x4000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_15                                                     (0x8000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_16                                                     (0x10000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_17                                                     (0x20000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_18                                                     (0x40000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_19                                                     (0x80000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_20                                                     (0x100000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_21                                                     (0x200000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_22                                                     (0x400000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_23                                                     (0x800000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_24                                                     (0x1000000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_25                                                     (0x2000000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_26                                                     (0x4000000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_27                                                     (0x8000000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_28                                                     (0x10000000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_29                                                     (0x20000000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_30                                                     (0x40000000U << DMA_CPAR_PA_Pos)
#define DMA_CPAR_PA_31                                                     (0x80000000UL << DMA_CPAR_PA_Pos)

