stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    DATA0    ===================================================== */
#define FLASH_DATA0_DATA0_Pos                                              (0UL)    /*!<FLASH DATA0: DATA0 (Bit 0) */
#define FLASH_DATA0_DATA0_Msk                                              (0xffffffffUL)   /*!< FLASH DATA0: DATA0 (Bitfield-Mask: 0xffffffff) */
#define FLASH_DATA0_DATA0                                                  FLASH_DATA0_DATA0_Msk
#define FLASH_DATA0_DATA0_0                                                (0x1U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_1                                                (0x2U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_2                                                (0x4U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_3                                                (0x8U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_4                                                (0x10U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_5                                                (0x20U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_6                                                (0x40U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_7                                                (0x80U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_8                                                (0x100U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_9                                                (0x200U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_10                                               (0x400U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_11                                               (0x800U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_12                                               (0x1000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_13                                               (0x2000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_14                                               (0x4000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_15                                               (0x8000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_16                                               (0x10000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_17                                               (0x20000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_18                                               (0x40000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_19                                               (0x80000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_20                                               (0x100000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_21                                               (0x200000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_22                                               (0x400000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_23                                               (0x800000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_24                                               (0x1000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_25                                               (0x2000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_26                                               (0x4000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_27                                               (0x8000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_28                                               (0x10000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_29                                               (0x20000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_30                                               (0x40000000U << FLASH_DATA0_DATA0_Pos)
#define FLASH_DATA0_DATA0_31                                               (0x80000000UL << FLASH_DATA0_DATA0_Pos)

/* =====================================================    DATA1    ===================================================== */
#define FLASH_DATA1_DATA1_Pos                                              (0UL)    /*!<FLASH DATA1: DATA1 (Bit 0) */
#define FLASH_DATA1_DATA1_Msk                                              (0xffffffffUL)   /*!< FLASH DATA1: DATA1 (Bitfield-Mask: 0xffffffff) */
#define FLASH_DATA1_DATA1                                                  FLASH_DATA1_DATA1_Msk
#define FLASH_DATA1_DATA1_0                                                (0x1U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_1                                                (0x2U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_2                                                (0x4U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_3                                                (0x8U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_4                                                (0x10U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_5                                                (0x20U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_6                                                (0x40U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_7                                                (0x80U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_8                                                (0x100U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_9                                                (0x200U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_10                                               (0x400U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_11                                               (0x800U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_12                                               (0x1000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_13                                               (0x2000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_14                                               (0x4000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_15                                               (0x8000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_16                                               (0x10000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_17                                               (0x20000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_18                                               (0x40000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_19                                               (0x80000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_20                                               (0x100000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_21                                               (0x200000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_22                                               (0x400000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_23                                               (0x800000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_24                                               (0x1000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_25                                               (0x2000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_26                                               (0x4000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_27                                               (0x8000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_28                                               (0x10000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_29                                               (0x20000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_30                                               (0x40000000U << FLASH_DATA1_DATA1_Pos)
#define FLASH_DATA1_DATA1_31                                               (0x80000000UL << FLASH_DATA1_DATA1_Pos)

