stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    DATA2    ===================================================== */
#define FLASH_DATA2_DATA2_Pos                                              (0UL)    /*!<FLASH DATA2: DATA2 (Bit 0) */
#define FLASH_DATA2_DATA2_Msk                                              (0xffffffffUL)   /*!< FLASH DATA2: DATA2 (Bitfield-Mask: 0xffffffff) */
#define FLASH_DATA2_DATA2                                                  FLASH_DATA2_DATA2_Msk
#define FLASH_DATA2_DATA2_0                                                (0x1U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_1                                                (0x2U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_2                                                (0x4U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_3                                                (0x8U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_4                                                (0x10U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_5                                                (0x20U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_6                                                (0x40U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_7                                                (0x80U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_8                                                (0x100U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_9                                                (0x200U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_10                                               (0x400U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_11                                               (0x800U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_12                                               (0x1000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_13                                               (0x2000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_14                                               (0x4000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_15                                               (0x8000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_16                                               (0x10000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_17                                               (0x20000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_18                                               (0x40000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_19                                               (0x80000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_20                                               (0x100000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_21                                               (0x200000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_22                                               (0x400000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_23                                               (0x800000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_24                                               (0x1000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_25                                               (0x2000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_26                                               (0x4000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_27                                               (0x8000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_28                                               (0x10000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_29                                               (0x20000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_30                                               (0x40000000U << FLASH_DATA2_DATA2_Pos)
#define FLASH_DATA2_DATA2_31                                               (0x80000000UL << FLASH_DATA2_DATA2_Pos)

/* =====================================================    DATA3    ===================================================== */
#define FLASH_DATA3_DATA3_Pos                                              (0UL)    /*!<FLASH DATA3: DATA3 (Bit 0) */
#define FLASH_DATA3_DATA3_Msk                                              (0xffffffffUL)   /*!< FLASH DATA3: DATA3 (Bitfield-Mask: 0xffffffff) */
#define FLASH_DATA3_DATA3                                                  FLASH_DATA3_DATA3_Msk
#define FLASH_DATA3_DATA3_0                                                (0x1U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_1                                                (0x2U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_2                                                (0x4U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_3                                                (0x8U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_4                                                (0x10U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_5                                                (0x20U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_6                                                (0x40U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_7                                                (0x80U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_8                                                (0x100U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_9                                                (0x200U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_10                                               (0x400U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_11                                               (0x800U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_12                                               (0x1000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_13                                               (0x2000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_14                                               (0x4000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_15                                               (0x8000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_16                                               (0x10000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_17                                               (0x20000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_18                                               (0x40000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_19                                               (0x80000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_20                                               (0x100000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_21                                               (0x200000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_22                                               (0x400000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_23                                               (0x800000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_24                                               (0x1000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_25                                               (0x2000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_26                                               (0x4000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_27                                               (0x8000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_28                                               (0x10000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_29                                               (0x20000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_30                                               (0x40000000U << FLASH_DATA3_DATA3_Pos)
#define FLASH_DATA3_DATA3_31                                               (0x80000000UL << FLASH_DATA3_DATA3_Pos)


/* =========================================================================================================================== */
/*=====================                                       SPI                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    CR1    ===================================================== */
#define SPI_CR1_BIDIMODE_Pos                                               (15UL)   /*!<SPI CR1: BIDIMODE (Bit 15) */
#define SPI_CR1_BIDIMODE_Msk                                               (0x8000UL)   /*!< SPI CR1: BIDIMODE (Bitfield-Mask: 0x01) */
#define SPI_CR1_BIDIMODE                                                   SPI_CR1_BIDIMODE_Msk
#define SPI_CR1_BIDIOE_Pos                                                 (14UL)   /*!<SPI CR1: BIDIOE (Bit 14) */
#define SPI_CR1_BIDIOE_Msk                                                 (0x4000UL)   /*!< SPI CR1: BIDIOE (Bitfield-Mask: 0x01) */
#define SPI_CR1_BIDIOE                                                     SPI_CR1_BIDIOE_Msk
#define SPI_CR1_CRCEN_Pos                                                  (13UL)   /*!<SPI CR1: CRCEN (Bit 13) */
#define SPI_CR1_CRCEN_Msk                                                  (0x2000UL)   /*!< SPI CR1: CRCEN (Bitfield-Mask: 0x01) */
#define SPI_CR1_CRCEN                                                      SPI_CR1_CRCEN_Msk
#define SPI_CR1_CRCNEXT_Pos                                                (12UL)   /*!<SPI CR1: CRCNEXT (Bit 12) */
#define SPI_CR1_CRCNEXT_Msk                                                (0x1000UL)   /*!< SPI CR1: CRCNEXT (Bitfield-Mask: 0x01) */
#define SPI_CR1_CRCNEXT                                                    SPI_CR1_CRCNEXT_Msk
#define SPI_CR1_CRCL_Pos                                                   (11UL)   /*!<SPI CR1: CRCL (Bit 11) */
#define SPI_CR1_CRCL_Msk                                                   (0x800UL)    /*!< SPI CR1: CRCL (Bitfield-Mask: 0x01) */
#define SPI_CR1_CRCL                                                       SPI_CR1_CRCL_Msk
#define SPI_CR1_RXONLY_Pos                                                 (10UL)   /*!<SPI CR1: RXONLY (Bit 10) */
#define SPI_CR1_RXONLY_Msk                                                 (0x400UL)    /*!< SPI CR1: RXONLY (Bitfield-Mask: 0x01) */
#define SPI_CR1_RXONLY                                                     SPI_CR1_RXONLY_Msk
#define SPI_CR1_SSM_Pos                                                    (9UL)    /*!<SPI CR1: SSM (Bit 9) */
#define SPI_CR1_SSM_Msk                                                    (0x200UL)    /*!< SPI CR1: SSM (Bitfield-Mask: 0x01) */
#define SPI_CR1_SSM                                                        SPI_CR1_SSM_Msk
#define SPI_CR1_SSI_Pos                                                    (8UL)    /*!<SPI CR1: SSI (Bit 8) */
#define SPI_CR1_SSI_Msk                                                    (0x100UL)    /*!< SPI CR1: SSI (Bitfield-Mask: 0x01) */
#define SPI_CR1_SSI                                                        SPI_CR1_SSI_Msk
#define SPI_CR1_LSBFIRST_Pos                                               (7UL)    /*!<SPI CR1: LSBFIRST (Bit 7) */
#define SPI_CR1_LSBFIRST_Msk                                               (0x80UL)   /*!< SPI CR1: LSBFIRST (Bitfield-Mask: 0x01) */
#define SPI_CR1_LSBFIRST                                                   SPI_CR1_LSBFIRST_Msk
#define SPI_CR1_SPE_Pos                                                    (6UL)    /*!<SPI CR1: SPE (Bit 6) */
#define SPI_CR1_SPE_Msk                                                    (0x40UL)   /*!< SPI CR1: SPE (Bitfield-Mask: 0x01) */
#define SPI_CR1_SPE                                                        SPI_CR1_SPE_Msk
#define SPI_CR1_BR_Pos                                                     (3UL)    /*!<SPI CR1: BR (Bit 3) */
#define SPI_CR1_BR_Msk                                                     (0x38UL)   /*!< SPI CR1: BR (Bitfield-Mask: 0x07) */
#define SPI_CR1_BR                                                         SPI_CR1_BR_Msk
#define SPI_CR1_BR_0                                                       (0x1U << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_1                                                       (0x2U << SPI_CR1_BR_Pos)
#define SPI_CR1_BR_2                                                       (0x4U << SPI_CR1_BR_Pos)
#define SPI_CR1_MSTR_Pos                                                   (2UL)    /*!<SPI CR1: MSTR (Bit 2) */
#define SPI_CR1_MSTR_Msk                                                   (0x4UL)    /*!< SPI CR1: MSTR (Bitfield-Mask: 0x01) */
#define SPI_CR1_MSTR                                                       SPI_CR1_MSTR_Msk
#define SPI_CR1_CPOL_Pos                                                   (1UL)    /*!<SPI CR1: CPOL (Bit 1) */
#define SPI_CR1_CPOL_Msk                                                   (0x2UL)    /*!< SPI CR1: CPOL (Bitfield-Mask: 0x01) */
#define SPI_CR1_CPOL                                                       SPI_CR1_CPOL_Msk
#define SPI_CR1_CPHA_Pos                                                   (0UL)    /*!<SPI CR1: CPHA (Bit 0) */
#define SPI_CR1_CPHA_Msk                                                   (0x1UL)    /*!< SPI CR1: CPHA (Bitfield-Mask: 0x01) */
#define SPI_CR1_CPHA                                                       SPI_CR1_CPHA_Msk

