stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    APB1ENR    ===================================================== */
#define RCC_APB1ENR_I2C1EN_Pos                                             (21UL)   /*!<RCC APB1ENR: I2C1EN (Bit 21) */
#define RCC_APB1ENR_I2C1EN_Msk                                             (0x200000UL)   /*!< RCC APB1ENR: I2C1EN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_I2C1EN                                                 RCC_APB1ENR_I2C1EN_Msk
#define RCC_APB1ENR_SPI3EN_Pos                                             (14UL)   /*!<RCC APB1ENR: SPI3EN (Bit 14) */
#define RCC_APB1ENR_SPI3EN_Msk                                             (0x4000UL)   /*!< RCC APB1ENR: SPI3EN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_SPI3EN                                                 RCC_APB1ENR_SPI3EN_Msk
#define RCC_APB1ENR_USARTEN_Pos                                            (10UL)   /*!<RCC APB1ENR: USARTEN (Bit 10) */
#define RCC_APB1ENR_USARTEN_Msk                                            (0x400UL)    /*!< RCC APB1ENR: USARTEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_USARTEN                                                RCC_APB1ENR_USARTEN_Msk
#define RCC_APB1ENR_LPUARTEN_Pos                                           (8UL)    /*!<RCC APB1ENR: LPUARTEN (Bit 8) */
#define RCC_APB1ENR_LPUARTEN_Msk                                           (0x100UL)    /*!< RCC APB1ENR: LPUARTEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_LPUARTEN                                               RCC_APB1ENR_LPUARTEN_Msk
#define RCC_APB1ENR_ADCANAEN_Pos                                           (5UL)    /*!<RCC APB1ENR: ADCANAEN (Bit 5) */
#define RCC_APB1ENR_ADCANAEN_Msk                                           (0x20UL)   /*!< RCC APB1ENR: ADCANAEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_ADCANAEN                                               RCC_APB1ENR_ADCANAEN_Msk
#define RCC_APB1ENR_ADCDIGEN_Pos                                           (4UL)    /*!<RCC APB1ENR: ADCDIGEN (Bit 4) */
#define RCC_APB1ENR_ADCDIGEN_Msk                                           (0x10UL)   /*!< RCC APB1ENR: ADCDIGEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_ADCDIGEN                                               RCC_APB1ENR_ADCDIGEN_Msk

/* =====================================================    APB2ENR    ===================================================== */
#define RCC_APB2ENR_CLKBLEDIV_Pos                                          (2UL)    /*!<RCC APB2ENR: CLKBLEDIV (Bit 2) */
#define RCC_APB2ENR_CLKBLEDIV_Msk                                          (0x4UL)    /*!< RCC APB2ENR: CLKBLEDIV (Bitfield-Mask: 0x01) */
#define RCC_APB2ENR_CLKBLEDIV                                              RCC_APB2ENR_CLKBLEDIV_Msk
#define RCC_APB2ENR_MRBLEEN_Pos                                            (0UL)    /*!<RCC APB2ENR: MRBLEEN (Bit 0) */
#define RCC_APB2ENR_MRBLEEN_Msk                                            (0x1UL)    /*!< RCC APB2ENR: MRBLEEN (Bitfield-Mask: 0x01) */
#define RCC_APB2ENR_MRBLEEN                                                RCC_APB2ENR_MRBLEEN_Msk

/* =====================================================    CSR    ===================================================== */
#define RCC_CSR_LOCKUPRSTF_Pos                                             (30UL)   /*!<RCC CSR: LOCKUPRSTF (Bit 30) */
#define RCC_CSR_LOCKUPRSTF_Msk                                             (0x40000000UL)   /*!< RCC CSR: LOCKUPRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_LOCKUPRSTF                                                 RCC_CSR_LOCKUPRSTF_Msk
#define RCC_CSR_WDGRSTF_Pos                                                (29UL)   /*!<RCC CSR: WDGRSTF (Bit 29) */
#define RCC_CSR_WDGRSTF_Msk                                                (0x20000000UL)   /*!< RCC CSR: WDGRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_WDGRSTF                                                    RCC_CSR_WDGRSTF_Msk
#define RCC_CSR_SFTRSTF_Pos                                                (28UL)   /*!<RCC CSR: SFTRSTF (Bit 28) */
#define RCC_CSR_SFTRSTF_Msk                                                (0x10000000UL)   /*!< RCC CSR: SFTRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_SFTRSTF                                                    RCC_CSR_SFTRSTF_Msk
#define RCC_CSR_PORRSTF_Pos                                                (27UL)   /*!<RCC CSR: PORRSTF (Bit 27) */
#define RCC_CSR_PORRSTF_Msk                                                (0x8000000UL)    /*!< RCC CSR: PORRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_PORRSTF                                                    RCC_CSR_PORRSTF_Msk
#define RCC_CSR_PADRSTF_Pos                                                (26UL)   /*!<RCC CSR: PADRSTF (Bit 26) */
#define RCC_CSR_PADRSTF_Msk                                                (0x4000000UL)    /*!< RCC CSR: PADRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_PADRSTF                                                    RCC_CSR_PADRSTF_Msk
#define RCC_CSR_RMVF_Pos                                                   (23UL)   /*!<RCC CSR: RMVF (Bit 23) */
#define RCC_CSR_RMVF_Msk                                                   (0x800000UL)   /*!< RCC CSR: RMVF (Bitfield-Mask: 0x01) */
#define RCC_CSR_RMVF                                                       RCC_CSR_RMVF_Msk

/* =====================================================    RFSWHSECR    ===================================================== */
#define RCC_RFSWHSECR_SWXOTUNE_Pos                                         (8UL)    /*!<RCC RFSWHSECR: SWXOTUNE (Bit 8) */
#define RCC_RFSWHSECR_SWXOTUNE_Msk                                         (0x3f00UL)   /*!< RCC RFSWHSECR: SWXOTUNE (Bitfield-Mask: 0x3f) */
#define RCC_RFSWHSECR_SWXOTUNE                                             RCC_RFSWHSECR_SWXOTUNE_Msk
#define RCC_RFSWHSECR_SWXOTUNE_0                                           (0x1U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_1                                           (0x2U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_2                                           (0x4U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_3                                           (0x8U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_4                                           (0x10U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_5                                           (0x20U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNEEN_Pos                                       (7UL)    /*!<RCC RFSWHSECR: SWXOTUNEEN (Bit 7) */
#define RCC_RFSWHSECR_SWXOTUNEEN_Msk                                       (0x80UL)   /*!< RCC RFSWHSECR: SWXOTUNEEN (Bitfield-Mask: 0x01) */
#define RCC_RFSWHSECR_SWXOTUNEEN                                           RCC_RFSWHSECR_SWXOTUNEEN_Msk
#define RCC_RFSWHSECR_GMC_Pos                                              (4UL)    /*!<RCC RFSWHSECR: GMC (Bit 4) */
#define RCC_RFSWHSECR_GMC_Msk                                              (0x70UL)   /*!< RCC RFSWHSECR: GMC (Bitfield-Mask: 0x07) */
#define RCC_RFSWHSECR_GMC                                                  RCC_RFSWHSECR_GMC_Msk
#define RCC_RFSWHSECR_GMC_0                                                (0x1U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_1                                                (0x2U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_2                                                (0x4U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_SATRG_Pos                                            (3UL)    /*!<RCC RFSWHSECR: SATRG (Bit 3) */
#define RCC_RFSWHSECR_SATRG_Msk                                            (0x8UL)    /*!< RCC RFSWHSECR: SATRG (Bitfield-Mask: 0x01) */
#define RCC_RFSWHSECR_SATRG                                                RCC_RFSWHSECR_SATRG_Msk

/* =====================================================    RFHSECR    ===================================================== */
#define RCC_RFHSECR_XOTUNE_Pos                                             (0UL)    /*!<RCC RFHSECR: XOTUNE (Bit 0) */
#define RCC_RFHSECR_XOTUNE_Msk                                             (0x3fUL)   /*!< RCC RFHSECR: XOTUNE (Bitfield-Mask: 0x3f) */
#define RCC_RFHSECR_XOTUNE                                                 RCC_RFHSECR_XOTUNE_Msk
#define RCC_RFHSECR_XOTUNE_0                                               (0x1U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_1                                               (0x2U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_2                                               (0x4U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_3                                               (0x8U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_4                                               (0x10U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_5                                               (0x20U << RCC_RFHSECR_XOTUNE_Pos)


/* =========================================================================================================================== */
/*=====================                                       PWR                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    CR1    ===================================================== */
#define PWR_CR1_ENBORL_Pos                                                 (8UL)    /*!<PWR CR1: ENBORL (Bit 8) */
#define PWR_CR1_ENBORL_Msk                                                 (0x100UL)    /*!< PWR CR1: ENBORL (Bitfield-Mask: 0x01) */
#define PWR_CR1_ENBORL                                                     PWR_CR1_ENBORL_Msk
#define PWR_CR1_APC_Pos                                                    (4UL)    /*!<PWR CR1: APC (Bit 4) */
#define PWR_CR1_APC_Msk                                                    (0x10UL)   /*!< PWR CR1: APC (Bitfield-Mask: 0x01) */
#define PWR_CR1_APC                                                        PWR_CR1_APC_Msk
#define PWR_CR1_IBIAS_RUN_STATE_Pos                                        (3UL)    /*!<PWR CR1: IBIAS_RUN_STATE (Bit 3) */
#define PWR_CR1_IBIAS_RUN_STATE_Msk                                        (0x8UL)    /*!< PWR CR1: IBIAS_RUN_STATE (Bitfield-Mask: 0x01) */
#define PWR_CR1_IBIAS_RUN_STATE                                            PWR_CR1_IBIAS_RUN_STATE_Msk
#define PWR_CR1_IBIAS_RUN_AUTO_Pos                                         (2UL)    /*!<PWR CR1: IBIAS_RUN_AUTO (Bit 2) */
#define PWR_CR1_IBIAS_RUN_AUTO_Msk                                         (0x4UL)    /*!< PWR CR1: IBIAS_RUN_AUTO (Bitfield-Mask: 0x01) */
#define PWR_CR1_IBIAS_RUN_AUTO                                             PWR_CR1_IBIAS_RUN_AUTO_Msk
#define PWR_CR1_ENSDNBOR_Pos                                               (1UL)    /*!<PWR CR1: ENSDNBOR (Bit 1) */
#define PWR_CR1_ENSDNBOR_Msk                                               (0x2UL)    /*!< PWR CR1: ENSDNBOR (Bitfield-Mask: 0x01) */
#define PWR_CR1_ENSDNBOR                                                   PWR_CR1_ENSDNBOR_Msk
#define PWR_CR1_LPMS_Pos                                                   (0UL)    /*!<PWR CR1: LPMS (Bit 0) */
#define PWR_CR1_LPMS_Msk                                                   (0x1UL)    /*!< PWR CR1: LPMS (Bitfield-Mask: 0x01) */
#define PWR_CR1_LPMS                                                       PWR_CR1_LPMS_Msk

