stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    CR2    ===================================================== */
#define PWR_CR2_GPIORET_Pos                                                (8UL)    /*!<PWR CR2: GPIORET (Bit 8) */
#define PWR_CR2_GPIORET_Msk                                                (0x100UL)    /*!< PWR CR2: GPIORET (Bitfield-Mask: 0x01) */
#define PWR_CR2_GPIORET                                                    PWR_CR2_GPIORET_Msk
#define PWR_CR2_RAMRET1_Pos                                                (5UL)    /*!<PWR CR2: RAMRET1 (Bit 5) */
#define PWR_CR2_RAMRET1_Msk                                                (0x20UL)   /*!< PWR CR2: RAMRET1 (Bitfield-Mask: 0x01) */
#define PWR_CR2_RAMRET1                                                    PWR_CR2_RAMRET1_Msk
#define PWR_CR2_DBGRET_Pos                                                 (4UL)    /*!<PWR CR2: DBGRET (Bit 4) */
#define PWR_CR2_DBGRET_Msk                                                 (0x10UL)   /*!< PWR CR2: DBGRET (Bitfield-Mask: 0x01) */
#define PWR_CR2_DBGRET                                                     PWR_CR2_DBGRET_Msk
#define PWR_CR2_PVDLS_Pos                                                  (1UL)    /*!<PWR CR2: PVDLS (Bit 1) */
#define PWR_CR2_PVDLS_Msk                                                  (0xeUL)    /*!< PWR CR2: PVDLS (Bitfield-Mask: 0x07) */
#define PWR_CR2_PVDLS                                                      PWR_CR2_PVDLS_Msk
#define PWR_CR2_PVDLS_0                                                    (0x1U << PWR_CR2_PVDLS_Pos)
#define PWR_CR2_PVDLS_1                                                    (0x2U << PWR_CR2_PVDLS_Pos)
#define PWR_CR2_PVDLS_2                                                    (0x4U << PWR_CR2_PVDLS_Pos)
#define PWR_CR2_PVDE_Pos                                                   (0UL)    /*!<PWR CR2: PVDE (Bit 0) */
#define PWR_CR2_PVDE_Msk                                                   (0x1UL)    /*!< PWR CR2: PVDE (Bitfield-Mask: 0x01) */
#define PWR_CR2_PVDE                                                       PWR_CR2_PVDE_Msk

/* =====================================================    CR3    ===================================================== */
#define PWR_CR3_EIWL_Pos                                                   (15UL)   /*!<PWR CR3: EIWL (Bit 15) */
#define PWR_CR3_EIWL_Msk                                                   (0x8000UL)   /*!< PWR CR3: EIWL (Bitfield-Mask: 0x01) */
#define PWR_CR3_EIWL                                                       PWR_CR3_EIWL_Msk
#define PWR_CR3_EIWL2_Pos                                                  (14UL)   /*!<PWR CR3: EIWL2 (Bit 14) */
#define PWR_CR3_EIWL2_Msk                                                  (0x4000UL)   /*!< PWR CR3: EIWL2 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EIWL2                                                      PWR_CR3_EIWL2_Msk
#define PWR_CR3_EWBLEHCPU_Pos                                              (13UL)   /*!<PWR CR3: EWBLEHCPU (Bit 13) */
#define PWR_CR3_EWBLEHCPU_Msk                                              (0x2000UL)   /*!< PWR CR3: EWBLEHCPU (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWBLEHCPU                                                  PWR_CR3_EWBLEHCPU_Msk
#define PWR_CR3_EWBLE_Pos                                                  (12UL)   /*!<PWR CR3: EWBLE (Bit 12) */
#define PWR_CR3_EWBLE_Msk                                                  (0x1000UL)   /*!< PWR CR3: EWBLE (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWBLE                                                      PWR_CR3_EWBLE_Msk
#define PWR_CR3_EWU11_Pos                                                  (11UL)   /*!<PWR CR3: EWU11 (Bit 11) */
#define PWR_CR3_EWU11_Msk                                                  (0x800UL)    /*!< PWR CR3: EWU11 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU11                                                      PWR_CR3_EWU11_Msk
#define PWR_CR3_EWU10_Pos                                                  (10UL)   /*!<PWR CR3: EWU10 (Bit 10) */
#define PWR_CR3_EWU10_Msk                                                  (0x400UL)    /*!< PWR CR3: EWU10 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU10                                                      PWR_CR3_EWU10_Msk
#define PWR_CR3_EWU9_Pos                                                   (9UL)    /*!<PWR CR3: EWU9 (Bit 9) */
#define PWR_CR3_EWU9_Msk                                                   (0x200UL)    /*!< PWR CR3: EWU9 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU9                                                       PWR_CR3_EWU9_Msk
#define PWR_CR3_EWU8_Pos                                                   (8UL)    /*!<PWR CR3: EWU8 (Bit 8) */
#define PWR_CR3_EWU8_Msk                                                   (0x100UL)    /*!< PWR CR3: EWU8 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU8                                                       PWR_CR3_EWU8_Msk
#define PWR_CR3_EWU7_Pos                                                   (7UL)    /*!<PWR CR3: EWU7 (Bit 7) */
#define PWR_CR3_EWU7_Msk                                                   (0x80UL)   /*!< PWR CR3: EWU7 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU7                                                       PWR_CR3_EWU7_Msk
#define PWR_CR3_EWU6_Pos                                                   (6UL)    /*!<PWR CR3: EWU6 (Bit 6) */
#define PWR_CR3_EWU6_Msk                                                   (0x40UL)   /*!< PWR CR3: EWU6 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU6                                                       PWR_CR3_EWU6_Msk
#define PWR_CR3_EWU5_Pos                                                   (5UL)    /*!<PWR CR3: EWU5 (Bit 5) */
#define PWR_CR3_EWU5_Msk                                                   (0x20UL)   /*!< PWR CR3: EWU5 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU5                                                       PWR_CR3_EWU5_Msk
#define PWR_CR3_EWU4_Pos                                                   (4UL)    /*!<PWR CR3: EWU4 (Bit 4) */
#define PWR_CR3_EWU4_Msk                                                   (0x10UL)   /*!< PWR CR3: EWU4 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU4                                                       PWR_CR3_EWU4_Msk
#define PWR_CR3_EWU3_Pos                                                   (3UL)    /*!<PWR CR3: EWU3 (Bit 3) */
#define PWR_CR3_EWU3_Msk                                                   (0x8UL)    /*!< PWR CR3: EWU3 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU3                                                       PWR_CR3_EWU3_Msk
#define PWR_CR3_EWU2_Pos                                                   (2UL)    /*!<PWR CR3: EWU2 (Bit 2) */
#define PWR_CR3_EWU2_Msk                                                   (0x4UL)    /*!< PWR CR3: EWU2 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU2                                                       PWR_CR3_EWU2_Msk
#define PWR_CR3_EWU1_Pos                                                   (1UL)    /*!<PWR CR3: EWU1 (Bit 1) */
#define PWR_CR3_EWU1_Msk                                                   (0x2UL)    /*!< PWR CR3: EWU1 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU1                                                       PWR_CR3_EWU1_Msk
#define PWR_CR3_EWU0_Pos                                                   (0UL)    /*!<PWR CR3: EWU0 (Bit 0) */
#define PWR_CR3_EWU0_Msk                                                   (0x1UL)    /*!< PWR CR3: EWU0 (Bitfield-Mask: 0x01) */
#define PWR_CR3_EWU0                                                       PWR_CR3_EWU0_Msk

/* =====================================================    CR4    ===================================================== */
#define PWR_CR4_WUP11_Pos                                                  (11UL)   /*!<PWR CR4: WUP11 (Bit 11) */
#define PWR_CR4_WUP11_Msk                                                  (0x800UL)    /*!< PWR CR4: WUP11 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP11                                                      PWR_CR4_WUP11_Msk
#define PWR_CR4_WUP10_Pos                                                  (10UL)   /*!<PWR CR4: WUP10 (Bit 10) */
#define PWR_CR4_WUP10_Msk                                                  (0x400UL)    /*!< PWR CR4: WUP10 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP10                                                      PWR_CR4_WUP10_Msk
#define PWR_CR4_WUP9_Pos                                                   (9UL)    /*!<PWR CR4: WUP9 (Bit 9) */
#define PWR_CR4_WUP9_Msk                                                   (0x200UL)    /*!< PWR CR4: WUP9 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP9                                                       PWR_CR4_WUP9_Msk
#define PWR_CR4_WUP8_Pos                                                   (8UL)    /*!<PWR CR4: WUP8 (Bit 8) */
#define PWR_CR4_WUP8_Msk                                                   (0x100UL)    /*!< PWR CR4: WUP8 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP8                                                       PWR_CR4_WUP8_Msk
#define PWR_CR4_WUP7_Pos                                                   (7UL)    /*!<PWR CR4: WUP7 (Bit 7) */
#define PWR_CR4_WUP7_Msk                                                   (0x80UL)   /*!< PWR CR4: WUP7 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP7                                                       PWR_CR4_WUP7_Msk
#define PWR_CR4_WUP6_Pos                                                   (6UL)    /*!<PWR CR4: WUP6 (Bit 6) */
#define PWR_CR4_WUP6_Msk                                                   (0x40UL)   /*!< PWR CR4: WUP6 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP6                                                       PWR_CR4_WUP6_Msk
#define PWR_CR4_WUP5_Pos                                                   (5UL)    /*!<PWR CR4: WUP5 (Bit 5) */
#define PWR_CR4_WUP5_Msk                                                   (0x20UL)   /*!< PWR CR4: WUP5 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP5                                                       PWR_CR4_WUP5_Msk
#define PWR_CR4_WUP4_Pos                                                   (4UL)    /*!<PWR CR4: WUP4 (Bit 4) */
#define PWR_CR4_WUP4_Msk                                                   (0x10UL)   /*!< PWR CR4: WUP4 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP4                                                       PWR_CR4_WUP4_Msk
#define PWR_CR4_WUP3_Pos                                                   (3UL)    /*!<PWR CR4: WUP3 (Bit 3) */
#define PWR_CR4_WUP3_Msk                                                   (0x8UL)    /*!< PWR CR4: WUP3 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP3                                                       PWR_CR4_WUP3_Msk
#define PWR_CR4_WUP2_Pos                                                   (2UL)    /*!<PWR CR4: WUP2 (Bit 2) */
#define PWR_CR4_WUP2_Msk                                                   (0x4UL)    /*!< PWR CR4: WUP2 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP2                                                       PWR_CR4_WUP2_Msk
#define PWR_CR4_WUP1_Pos                                                   (1UL)    /*!<PWR CR4: WUP1 (Bit 1) */
#define PWR_CR4_WUP1_Msk                                                   (0x2UL)    /*!< PWR CR4: WUP1 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP1                                                       PWR_CR4_WUP1_Msk
#define PWR_CR4_WUP0_Pos                                                   (0UL)    /*!<PWR CR4: WUP0 (Bit 0) */
#define PWR_CR4_WUP0_Msk                                                   (0x1UL)    /*!< PWR CR4: WUP0 (Bitfield-Mask: 0x01) */
#define PWR_CR4_WUP0                                                       PWR_CR4_WUP0_Msk

/* =====================================================    SR1    ===================================================== */
#define PWR_SR1_IWUF_Pos                                                   (15UL)   /*!<PWR SR1: IWUF (Bit 15) */
#define PWR_SR1_IWUF_Msk                                                   (0x8000UL)   /*!< PWR SR1: IWUF (Bitfield-Mask: 0x01) */
#define PWR_SR1_IWUF                                                       PWR_SR1_IWUF_Msk
#define PWR_SR1_IWUF2_Pos                                                  (14UL)   /*!<PWR SR1: IWUF2 (Bit 14) */
#define PWR_SR1_IWUF2_Msk                                                  (0x4000UL)   /*!< PWR SR1: IWUF2 (Bitfield-Mask: 0x01) */
#define PWR_SR1_IWUF2                                                      PWR_SR1_IWUF2_Msk
#define PWR_SR1_WBLEHCPUF_Pos                                              (13UL)   /*!<PWR SR1: WBLEHCPUF (Bit 13) */
#define PWR_SR1_WBLEHCPUF_Msk                                              (0x2000UL)   /*!< PWR SR1: WBLEHCPUF (Bitfield-Mask: 0x01) */
#define PWR_SR1_WBLEHCPUF                                                  PWR_SR1_WBLEHCPUF_Msk
#define PWR_SR1_WBLEF_Pos                                                  (12UL)   /*!<PWR SR1: WBLEF (Bit 12) */
#define PWR_SR1_WBLEF_Msk                                                  (0x1000UL)   /*!< PWR SR1: WBLEF (Bitfield-Mask: 0x01) */
#define PWR_SR1_WBLEF                                                      PWR_SR1_WBLEF_Msk
#define PWR_SR1_WUF11_Pos                                                  (11UL)   /*!<PWR SR1: WUF11 (Bit 11) */
#define PWR_SR1_WUF11_Msk                                                  (0x800UL)    /*!< PWR SR1: WUF11 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF11                                                      PWR_SR1_WUF11_Msk
#define PWR_SR1_WUF10_Pos                                                  (10UL)   /*!<PWR SR1: WUF10 (Bit 10) */
#define PWR_SR1_WUF10_Msk                                                  (0x400UL)    /*!< PWR SR1: WUF10 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF10                                                      PWR_SR1_WUF10_Msk
#define PWR_SR1_WUF9_Pos                                                   (9UL)    /*!<PWR SR1: WUF9 (Bit 9) */
#define PWR_SR1_WUF9_Msk                                                   (0x200UL)    /*!< PWR SR1: WUF9 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF9                                                       PWR_SR1_WUF9_Msk
#define PWR_SR1_WUF8_Pos                                                   (8UL)    /*!<PWR SR1: WUF8 (Bit 8) */
#define PWR_SR1_WUF8_Msk                                                   (0x100UL)    /*!< PWR SR1: WUF8 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF8                                                       PWR_SR1_WUF8_Msk
#define PWR_SR1_WUF7_Pos                                                   (7UL)    /*!<PWR SR1: WUF7 (Bit 7) */
#define PWR_SR1_WUF7_Msk                                                   (0x80UL)   /*!< PWR SR1: WUF7 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF7                                                       PWR_SR1_WUF7_Msk
#define PWR_SR1_WUF6_Pos                                                   (6UL)    /*!<PWR SR1: WUF6 (Bit 6) */
#define PWR_SR1_WUF6_Msk                                                   (0x40UL)   /*!< PWR SR1: WUF6 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF6                                                       PWR_SR1_WUF6_Msk
#define PWR_SR1_WUF5_Pos                                                   (5UL)    /*!<PWR SR1: WUF5 (Bit 5) */
#define PWR_SR1_WUF5_Msk                                                   (0x20UL)   /*!< PWR SR1: WUF5 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF5                                                       PWR_SR1_WUF5_Msk
#define PWR_SR1_WUF4_Pos                                                   (4UL)    /*!<PWR SR1: WUF4 (Bit 4) */
#define PWR_SR1_WUF4_Msk                                                   (0x10UL)   /*!< PWR SR1: WUF4 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF4                                                       PWR_SR1_WUF4_Msk
#define PWR_SR1_WUF3_Pos                                                   (3UL)    /*!<PWR SR1: WUF3 (Bit 3) */
#define PWR_SR1_WUF3_Msk                                                   (0x8UL)    /*!< PWR SR1: WUF3 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF3                                                       PWR_SR1_WUF3_Msk
#define PWR_SR1_WUF2_Pos                                                   (2UL)    /*!<PWR SR1: WUF2 (Bit 2) */
#define PWR_SR1_WUF2_Msk                                                   (0x4UL)    /*!< PWR SR1: WUF2 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF2                                                       PWR_SR1_WUF2_Msk
#define PWR_SR1_WUF1_Pos                                                   (1UL)    /*!<PWR SR1: WUF1 (Bit 1) */
#define PWR_SR1_WUF1_Msk                                                   (0x2UL)    /*!< PWR SR1: WUF1 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF1                                                       PWR_SR1_WUF1_Msk
#define PWR_SR1_WUF0_Pos                                                   (0UL)    /*!<PWR SR1: WUF0 (Bit 0) */
#define PWR_SR1_WUF0_Msk                                                   (0x1UL)    /*!< PWR SR1: WUF0 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF0                                                       PWR_SR1_WUF0_Msk

/* =====================================================    SR2    ===================================================== */
#define PWR_SR2_IOBOOTVAL_Pos                                              (12UL)   /*!<PWR SR2: IOBOOTVAL (Bit 12) */
#define PWR_SR2_IOBOOTVAL_Msk                                              (0xf000UL)   /*!< PWR SR2: IOBOOTVAL (Bitfield-Mask: 0x0f) */
#define PWR_SR2_IOBOOTVAL                                                  PWR_SR2_IOBOOTVAL_Msk
#define PWR_SR2_IOBOOTVAL_0                                                (0x1U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_IOBOOTVAL_1                                                (0x2U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_IOBOOTVAL_2                                                (0x4U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_IOBOOTVAL_3                                                (0x8U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_PVDO_Pos                                                   (11UL)   /*!<PWR SR2: PVDO (Bit 11) */
#define PWR_SR2_PVDO_Msk                                                   (0x800UL)    /*!< PWR SR2: PVDO (Bitfield-Mask: 0x01) */
#define PWR_SR2_PVDO                                                       PWR_SR2_PVDO_Msk
#define PWR_SR2_REGLPS_Pos                                                 (8UL)    /*!<PWR SR2: REGLPS (Bit 8) */
#define PWR_SR2_REGLPS_Msk                                                 (0x100UL)    /*!< PWR SR2: REGLPS (Bitfield-Mask: 0x01) */
#define PWR_SR2_REGLPS                                                     PWR_SR2_REGLPS_Msk
#define PWR_SR2_IOBOOTVAL2_Pos                                             (4UL)    /*!<PWR SR2: IOBOOTVAL2 (Bit 4) */
#define PWR_SR2_IOBOOTVAL2_Msk                                             (0xf0UL)   /*!< PWR SR2: IOBOOTVAL2 (Bitfield-Mask: 0x0f) */
#define PWR_SR2_IOBOOTVAL2                                                 PWR_SR2_IOBOOTVAL2_Msk
#define PWR_SR2_IOBOOTVAL2_0                                               (0x1U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_IOBOOTVAL2_1                                               (0x2U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_IOBOOTVAL2_2                                               (0x4U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_IOBOOTVAL2_3                                               (0x8U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_SMPSRDY_Pos                                                (2UL)    /*!<PWR SR2: SMPSRDY (Bit 2) */
#define PWR_SR2_SMPSRDY_Msk                                                (0x4UL)    /*!< PWR SR2: SMPSRDY (Bitfield-Mask: 0x01) */
#define PWR_SR2_SMPSRDY                                                    PWR_SR2_SMPSRDY_Msk
#define PWR_SR2_SMPSENR_Pos                                                (1UL)    /*!<PWR SR2: SMPSENR (Bit 1) */
#define PWR_SR2_SMPSENR_Msk                                                (0x2UL)    /*!< PWR SR2: SMPSENR (Bitfield-Mask: 0x01) */
#define PWR_SR2_SMPSENR                                                    PWR_SR2_SMPSENR_Msk
#define PWR_SR2_SMPSBYPR_Pos                                               (0UL)    /*!<PWR SR2: SMPSBYPR (Bit 0) */
#define PWR_SR2_SMPSBYPR_Msk                                               (0x1UL)    /*!< PWR SR2: SMPSBYPR (Bitfield-Mask: 0x01) */
#define PWR_SR2_SMPSBYPR                                                   PWR_SR2_SMPSBYPR_Msk

