stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    SR3    ===================================================== */
#define PWR_SR3_WUF19_Pos                                                  (7UL)    /*!<PWR SR3: WUF19 (Bit 7) */
#define PWR_SR3_WUF19_Msk                                                  (0x80UL)   /*!< PWR SR3: WUF19 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF19                                                      PWR_SR3_WUF19_Msk
#define PWR_SR3_WUF18_Pos                                                  (6UL)    /*!<PWR SR3: WUF18 (Bit 6) */
#define PWR_SR3_WUF18_Msk                                                  (0x40UL)   /*!< PWR SR3: WUF18 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF18                                                      PWR_SR3_WUF18_Msk
#define PWR_SR3_WUF17_Pos                                                  (5UL)    /*!<PWR SR3: WUF17 (Bit 5) */
#define PWR_SR3_WUF17_Msk                                                  (0x20UL)   /*!< PWR SR3: WUF17 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF17                                                      PWR_SR3_WUF17_Msk
#define PWR_SR3_WUF16_Pos                                                  (4UL)    /*!<PWR SR3: WUF16 (Bit 4) */
#define PWR_SR3_WUF16_Msk                                                  (0x10UL)   /*!< PWR SR3: WUF16 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF16                                                      PWR_SR3_WUF16_Msk
#define PWR_SR3_WUF15_Pos                                                  (3UL)    /*!<PWR SR3: WUF15 (Bit 3) */
#define PWR_SR3_WUF15_Msk                                                  (0x8UL)    /*!< PWR SR3: WUF15 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF15                                                      PWR_SR3_WUF15_Msk
#define PWR_SR3_WUF14_Pos                                                  (2UL)    /*!<PWR SR3: WUF14 (Bit 2) */
#define PWR_SR3_WUF14_Msk                                                  (0x4UL)    /*!< PWR SR3: WUF14 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF14                                                      PWR_SR3_WUF14_Msk
#define PWR_SR3_WUF13_Pos                                                  (1UL)    /*!<PWR SR3: WUF13 (Bit 1) */
#define PWR_SR3_WUF13_Msk                                                  (0x2UL)    /*!< PWR SR3: WUF13 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF13                                                      PWR_SR3_WUF13_Msk
#define PWR_SR3_WUF12_Pos                                                  (0UL)    /*!<PWR SR3: WUF12 (Bit 0) */
#define PWR_SR3_WUF12_Msk                                                  (0x1UL)    /*!< PWR SR3: WUF12 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF12                                                      PWR_SR3_WUF12_Msk

/* =====================================================    DBGR    ===================================================== */
#define PWR_DBGR_DEEPSTOP2_Pos                                             (0UL)    /*!<PWR DBGR: DEEPSTOP2 (Bit 0) */
#define PWR_DBGR_DEEPSTOP2_Msk                                             (0x1UL)    /*!< PWR DBGR: DEEPSTOP2 (Bitfield-Mask: 0x01) */
#define PWR_DBGR_DEEPSTOP2                                                 PWR_DBGR_DEEPSTOP2_Msk

/* =====================================================    EXTSRR    ===================================================== */
#define PWR_EXTSRR_RFPHASEF_Pos                                            (10UL)   /*!<PWR EXTSRR: RFPHASEF (Bit 10) */
#define PWR_EXTSRR_RFPHASEF_Msk                                            (0x400UL)    /*!< PWR EXTSRR: RFPHASEF (Bitfield-Mask: 0x01) */
#define PWR_EXTSRR_RFPHASEF                                                PWR_EXTSRR_RFPHASEF_Msk
#define PWR_EXTSRR_DEEPSTOPF_Pos                                           (9UL)    /*!<PWR EXTSRR: DEEPSTOPF (Bit 9) */
#define PWR_EXTSRR_DEEPSTOPF_Msk                                           (0x200UL)    /*!< PWR EXTSRR: DEEPSTOPF (Bitfield-Mask: 0x01) */
#define PWR_EXTSRR_DEEPSTOPF                                               PWR_EXTSRR_DEEPSTOPF_Msk

/* =====================================================    TRIMR    ===================================================== */
#define PWR_TRIMR_SMPS_TRIM_Pos                                            (8UL)    /*!<PWR TRIMR: SMPS_TRIM (Bit 8) */
#define PWR_TRIMR_SMPS_TRIM_Msk                                            (0x700UL)    /*!< PWR TRIMR: SMPS_TRIM (Bitfield-Mask: 0x07) */
#define PWR_TRIMR_SMPS_TRIM                                                PWR_TRIMR_SMPS_TRIM_Msk
#define PWR_TRIMR_SMPS_TRIM_0                                              (0x1U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_SMPS_TRIM_1                                              (0x2U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_SMPS_TRIM_2                                              (0x4U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_TRIM_MR_Pos                                              (4UL)    /*!<PWR TRIMR: TRIM_MR (Bit 4) */
#define PWR_TRIMR_TRIM_MR_Msk                                              (0xf0UL)   /*!< PWR TRIMR: TRIM_MR (Bitfield-Mask: 0x0f) */
#define PWR_TRIMR_TRIM_MR                                                  PWR_TRIMR_TRIM_MR_Msk
#define PWR_TRIMR_TRIM_MR_0                                                (0x1U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_1                                                (0x2U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_2                                                (0x4U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_3                                                (0x8U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_Pos                                         (0UL)    /*!<PWR TRIMR: RFD_REG_TRIM (Bit 0) */
#define PWR_TRIMR_RFD_REG_TRIM_Msk                                         (0xfUL)    /*!< PWR TRIMR: RFD_REG_TRIM (Bitfield-Mask: 0x0f) */
#define PWR_TRIMR_RFD_REG_TRIM                                             PWR_TRIMR_RFD_REG_TRIM_Msk
#define PWR_TRIMR_RFD_REG_TRIM_0                                           (0x1U << PWR_TRIMR_RFD_REG_TRIM_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_1                                           (0x2U << PWR_TRIMR_RFD_REG_TRIM_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_2                                           (0x4U << PWR_TRIMR_RFD_REG_TRIM_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_3                                           (0x8U << PWR_TRIMR_RFD_REG_TRIM_Pos)

