stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    AFRH    ===================================================== */
#define GPIO_AFRH_AFSEL15_Pos                                              (28UL)   /*!<GPIO AFRH: AFSEL15 (Bit 28) */
#define GPIO_AFRH_AFSEL15_Msk                                              (0xf0000000UL)   /*!< GPIO AFRH: AFSEL15 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRH_AFSEL15                                                  GPIO_AFRH_AFSEL15_Msk
#define GPIO_AFRH_AFSEL15_0                                                (0x1U << GPIO_AFRH_AFSEL15_Pos)
#define GPIO_AFRH_AFSEL15_1                                                (0x2U << GPIO_AFRH_AFSEL15_Pos)
#define GPIO_AFRH_AFSEL15_2                                                (0x4U << GPIO_AFRH_AFSEL15_Pos)
#define GPIO_AFRH_AFSEL15_3                                                (0x8U << GPIO_AFRH_AFSEL15_Pos)
#define GPIO_AFRH_AFSEL14_Pos                                              (24UL)   /*!<GPIO AFRH: AFSEL14 (Bit 24) */
#define GPIO_AFRH_AFSEL14_Msk                                              (0xf000000UL)    /*!< GPIO AFRH: AFSEL14 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRH_AFSEL14                                                  GPIO_AFRH_AFSEL14_Msk
#define GPIO_AFRH_AFSEL14_0                                                (0x1U << GPIO_AFRH_AFSEL14_Pos)
#define GPIO_AFRH_AFSEL14_1                                                (0x2U << GPIO_AFRH_AFSEL14_Pos)
#define GPIO_AFRH_AFSEL14_2                                                (0x4U << GPIO_AFRH_AFSEL14_Pos)
#define GPIO_AFRH_AFSEL14_3                                                (0x8U << GPIO_AFRH_AFSEL14_Pos)
#define GPIO_AFRH_AFSEL13_Pos                                              (20UL)   /*!<GPIO AFRH: AFSEL13 (Bit 20) */
#define GPIO_AFRH_AFSEL13_Msk                                              (0xf00000UL)   /*!< GPIO AFRH: AFSEL13 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRH_AFSEL13                                                  GPIO_AFRH_AFSEL13_Msk
#define GPIO_AFRH_AFSEL13_0                                                (0x1U << GPIO_AFRH_AFSEL13_Pos)
#define GPIO_AFRH_AFSEL13_1                                                (0x2U << GPIO_AFRH_AFSEL13_Pos)
#define GPIO_AFRH_AFSEL13_2                                                (0x4U << GPIO_AFRH_AFSEL13_Pos)
#define GPIO_AFRH_AFSEL13_3                                                (0x8U << GPIO_AFRH_AFSEL13_Pos)
#define GPIO_AFRH_AFSEL12_Pos                                              (16UL)   /*!<GPIO AFRH: AFSEL12 (Bit 16) */
#define GPIO_AFRH_AFSEL12_Msk                                              (0xf0000UL)    /*!< GPIO AFRH: AFSEL12 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRH_AFSEL12                                                  GPIO_AFRH_AFSEL12_Msk
#define GPIO_AFRH_AFSEL12_0                                                (0x1U << GPIO_AFRH_AFSEL12_Pos)
#define GPIO_AFRH_AFSEL12_1                                                (0x2U << GPIO_AFRH_AFSEL12_Pos)
#define GPIO_AFRH_AFSEL12_2                                                (0x4U << GPIO_AFRH_AFSEL12_Pos)
#define GPIO_AFRH_AFSEL12_3                                                (0x8U << GPIO_AFRH_AFSEL12_Pos)
#define GPIO_AFRH_AFSEL11_Pos                                              (12UL)   /*!<GPIO AFRH: AFSEL11 (Bit 12) */
#define GPIO_AFRH_AFSEL11_Msk                                              (0xf000UL)   /*!< GPIO AFRH: AFSEL11 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRH_AFSEL11                                                  GPIO_AFRH_AFSEL11_Msk
#define GPIO_AFRH_AFSEL11_0                                                (0x1U << GPIO_AFRH_AFSEL11_Pos)
#define GPIO_AFRH_AFSEL11_1                                                (0x2U << GPIO_AFRH_AFSEL11_Pos)
#define GPIO_AFRH_AFSEL11_2                                                (0x4U << GPIO_AFRH_AFSEL11_Pos)
#define GPIO_AFRH_AFSEL11_3                                                (0x8U << GPIO_AFRH_AFSEL11_Pos)
#define GPIO_AFRH_AFSEL10_Pos                                              (8UL)    /*!<GPIO AFRH: AFSEL10 (Bit 8) */
#define GPIO_AFRH_AFSEL10_Msk                                              (0xf00UL)    /*!< GPIO AFRH: AFSEL10 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRH_AFSEL10                                                  GPIO_AFRH_AFSEL10_Msk
#define GPIO_AFRH_AFSEL10_0                                                (0x1U << GPIO_AFRH_AFSEL10_Pos)
#define GPIO_AFRH_AFSEL10_1                                                (0x2U << GPIO_AFRH_AFSEL10_Pos)
#define GPIO_AFRH_AFSEL10_2                                                (0x4U << GPIO_AFRH_AFSEL10_Pos)
#define GPIO_AFRH_AFSEL10_3                                                (0x8U << GPIO_AFRH_AFSEL10_Pos)
#define GPIO_AFRH_AFSEL9_Pos                                               (4UL)    /*!<GPIO AFRH: AFSEL9 (Bit 4) */
#define GPIO_AFRH_AFSEL9_Msk                                               (0xf0UL)   /*!< GPIO AFRH: AFSEL9 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRH_AFSEL9                                                   GPIO_AFRH_AFSEL9_Msk
#define GPIO_AFRH_AFSEL9_0                                                 (0x1U << GPIO_AFRH_AFSEL9_Pos)
#define GPIO_AFRH_AFSEL9_1                                                 (0x2U << GPIO_AFRH_AFSEL9_Pos)
#define GPIO_AFRH_AFSEL9_2                                                 (0x4U << GPIO_AFRH_AFSEL9_Pos)
#define GPIO_AFRH_AFSEL9_3                                                 (0x8U << GPIO_AFRH_AFSEL9_Pos)
#define GPIO_AFRH_AFSEL8_Pos                                               (0UL)    /*!<GPIO AFRH: AFSEL8 (Bit 0) */
#define GPIO_AFRH_AFSEL8_Msk                                               (0xfUL)    /*!< GPIO AFRH: AFSEL8 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRH_AFSEL8                                                   GPIO_AFRH_AFSEL8_Msk
#define GPIO_AFRH_AFSEL8_0                                                 (0x1U << GPIO_AFRH_AFSEL8_Pos)
#define GPIO_AFRH_AFSEL8_1                                                 (0x2U << GPIO_AFRH_AFSEL8_Pos)
#define GPIO_AFRH_AFSEL8_2                                                 (0x4U << GPIO_AFRH_AFSEL8_Pos)
#define GPIO_AFRH_AFSEL8_3                                                 (0x8U << GPIO_AFRH_AFSEL8_Pos)

/* =====================================================    BRR    ===================================================== */
#define GPIO_BRR_BR15_Pos                                                  (15UL)   /*!<GPIO BRR: BR15 (Bit 15) */
#define GPIO_BRR_BR15_Msk                                                  (0x8000UL)   /*!< GPIO BRR: BR15 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR15                                                      GPIO_BRR_BR15_Msk
#define GPIO_BRR_BR14_Pos                                                  (14UL)   /*!<GPIO BRR: BR14 (Bit 14) */
#define GPIO_BRR_BR14_Msk                                                  (0x4000UL)   /*!< GPIO BRR: BR14 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR14                                                      GPIO_BRR_BR14_Msk
#define GPIO_BRR_BR13_Pos                                                  (13UL)   /*!<GPIO BRR: BR13 (Bit 13) */
#define GPIO_BRR_BR13_Msk                                                  (0x2000UL)   /*!< GPIO BRR: BR13 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR13                                                      GPIO_BRR_BR13_Msk
#define GPIO_BRR_BR12_Pos                                                  (12UL)   /*!<GPIO BRR: BR12 (Bit 12) */
#define GPIO_BRR_BR12_Msk                                                  (0x1000UL)   /*!< GPIO BRR: BR12 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR12                                                      GPIO_BRR_BR12_Msk
#define GPIO_BRR_BR11_Pos                                                  (11UL)   /*!<GPIO BRR: BR11 (Bit 11) */
#define GPIO_BRR_BR11_Msk                                                  (0x800UL)    /*!< GPIO BRR: BR11 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR11                                                      GPIO_BRR_BR11_Msk
#define GPIO_BRR_BR10_Pos                                                  (10UL)   /*!<GPIO BRR: BR10 (Bit 10) */
#define GPIO_BRR_BR10_Msk                                                  (0x400UL)    /*!< GPIO BRR: BR10 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR10                                                      GPIO_BRR_BR10_Msk
#define GPIO_BRR_BR9_Pos                                                   (9UL)    /*!<GPIO BRR: BR9 (Bit 9) */
#define GPIO_BRR_BR9_Msk                                                   (0x200UL)    /*!< GPIO BRR: BR9 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR9                                                       GPIO_BRR_BR9_Msk
#define GPIO_BRR_BR8_Pos                                                   (8UL)    /*!<GPIO BRR: BR8 (Bit 8) */
#define GPIO_BRR_BR8_Msk                                                   (0x100UL)    /*!< GPIO BRR: BR8 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR8                                                       GPIO_BRR_BR8_Msk
#define GPIO_BRR_BR7_Pos                                                   (7UL)    /*!<GPIO BRR: BR7 (Bit 7) */
#define GPIO_BRR_BR7_Msk                                                   (0x80UL)   /*!< GPIO BRR: BR7 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR7                                                       GPIO_BRR_BR7_Msk
#define GPIO_BRR_BR6_Pos                                                   (6UL)    /*!<GPIO BRR: BR6 (Bit 6) */
#define GPIO_BRR_BR6_Msk                                                   (0x40UL)   /*!< GPIO BRR: BR6 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR6                                                       GPIO_BRR_BR6_Msk
#define GPIO_BRR_BR5_Pos                                                   (5UL)    /*!<GPIO BRR: BR5 (Bit 5) */
#define GPIO_BRR_BR5_Msk                                                   (0x20UL)   /*!< GPIO BRR: BR5 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR5                                                       GPIO_BRR_BR5_Msk
#define GPIO_BRR_BR4_Pos                                                   (4UL)    /*!<GPIO BRR: BR4 (Bit 4) */
#define GPIO_BRR_BR4_Msk                                                   (0x10UL)   /*!< GPIO BRR: BR4 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR4                                                       GPIO_BRR_BR4_Msk
#define GPIO_BRR_BR3_Pos                                                   (3UL)    /*!<GPIO BRR: BR3 (Bit 3) */
#define GPIO_BRR_BR3_Msk                                                   (0x8UL)    /*!< GPIO BRR: BR3 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR3                                                       GPIO_BRR_BR3_Msk
#define GPIO_BRR_BR2_Pos                                                   (2UL)    /*!<GPIO BRR: BR2 (Bit 2) */
#define GPIO_BRR_BR2_Msk                                                   (0x4UL)    /*!< GPIO BRR: BR2 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR2                                                       GPIO_BRR_BR2_Msk
#define GPIO_BRR_BR1_Pos                                                   (1UL)    /*!<GPIO BRR: BR1 (Bit 1) */
#define GPIO_BRR_BR1_Msk                                                   (0x2UL)    /*!< GPIO BRR: BR1 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR1                                                       GPIO_BRR_BR1_Msk
#define GPIO_BRR_BR0_Pos                                                   (0UL)    /*!<GPIO BRR: BR0 (Bit 0) */
#define GPIO_BRR_BR0_Msk                                                   (0x1UL)    /*!< GPIO BRR: BR0 (Bitfield-Mask: 0x01) */
#define GPIO_BRR_BR0                                                       GPIO_BRR_BR0_Msk


/* =========================================================================================================================== */
/*=====================                                       TIM                                       ===================== */
/* =========================================================================================================================== */
/*
* @brief Specific device feature definitions  (not present on all devices in the STM32WB0 series)
*/
#define TIM_DMA_SUPPORT                       /*!< DMA request generation is supported */


/* =====================================================    CR1    ===================================================== */
#define TIM_CR1_UIFREMAP_Pos                                               (11UL)   /*!<TIM CR1: UIFREMAP (Bit 11) */
#define TIM_CR1_UIFREMAP_Msk                                               (0x800UL)    /*!< TIM CR1: UIFREMAP (Bitfield-Mask: 0x01) */
#define TIM_CR1_UIFREMAP                                                   TIM_CR1_UIFREMAP_Msk
#define TIM_CR1_CKD_Pos                                                    (8UL)    /*!<TIM CR1: CKD (Bit 8) */
#define TIM_CR1_CKD_Msk                                                    (0x300UL)    /*!< TIM CR1: CKD (Bitfield-Mask: 0x03) */
#define TIM_CR1_CKD                                                        TIM_CR1_CKD_Msk
#define TIM_CR1_CKD_0                                                      (0x1U << TIM_CR1_CKD_Pos)
#define TIM_CR1_CKD_1                                                      (0x2U << TIM_CR1_CKD_Pos)
#define TIM_CR1_ARPE_Pos                                                   (7UL)    /*!<TIM CR1: ARPE (Bit 7) */
#define TIM_CR1_ARPE_Msk                                                   (0x80UL)   /*!< TIM CR1: ARPE (Bitfield-Mask: 0x01) */
#define TIM_CR1_ARPE                                                       TIM_CR1_ARPE_Msk
#define TIM_CR1_CMS_Pos                                                    (5UL)    /*!<TIM CR1: CMS (Bit 5) */
#define TIM_CR1_CMS_Msk                                                    (0x60UL)   /*!< TIM CR1: CMS (Bitfield-Mask: 0x03) */
#define TIM_CR1_CMS                                                        TIM_CR1_CMS_Msk
#define TIM_CR1_CMS_0                                                      (0x1U << TIM_CR1_CMS_Pos)
#define TIM_CR1_CMS_1                                                      (0x2U << TIM_CR1_CMS_Pos)
#define TIM_CR1_DIR_Pos                                                    (4UL)    /*!<TIM CR1: DIR (Bit 4) */
#define TIM_CR1_DIR_Msk                                                    (0x10UL)   /*!< TIM CR1: DIR (Bitfield-Mask: 0x01) */
#define TIM_CR1_DIR                                                        TIM_CR1_DIR_Msk
#define TIM_CR1_OPM_Pos                                                    (3UL)    /*!<TIM CR1: OPM (Bit 3) */
#define TIM_CR1_OPM_Msk                                                    (0x8UL)    /*!< TIM CR1: OPM (Bitfield-Mask: 0x01) */
#define TIM_CR1_OPM                                                        TIM_CR1_OPM_Msk
#define TIM_CR1_URS_Pos                                                    (2UL)    /*!<TIM CR1: URS (Bit 2) */
#define TIM_CR1_URS_Msk                                                    (0x4UL)    /*!< TIM CR1: URS (Bitfield-Mask: 0x01) */
#define TIM_CR1_URS                                                        TIM_CR1_URS_Msk
#define TIM_CR1_UDIS_Pos                                                   (1UL)    /*!<TIM CR1: UDIS (Bit 1) */
#define TIM_CR1_UDIS_Msk                                                   (0x2UL)    /*!< TIM CR1: UDIS (Bitfield-Mask: 0x01) */
#define TIM_CR1_UDIS                                                       TIM_CR1_UDIS_Msk
#define TIM_CR1_CEN_Pos                                                    (0UL)    /*!<TIM CR1: CEN (Bit 0) */
#define TIM_CR1_CEN_Msk                                                    (0x1UL)    /*!< TIM CR1: CEN (Bitfield-Mask: 0x01) */
#define TIM_CR1_CEN                                                        TIM_CR1_CEN_Msk

