stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    CR2    ===================================================== */
#define TIM_CR2_OIS1N_Pos                                                  (9UL)    /*!<TIM CR2: OIS1N (Bit 9) */
#define TIM_CR2_OIS1N_Msk                                                  (0x200UL)    /*!< TIM CR2: OIS1N (Bitfield-Mask: 0x01) */
#define TIM_CR2_OIS1N                                                      TIM_CR2_OIS1N_Msk
#define TIM_CR2_OIS1_Pos                                                   (8UL)    /*!<TIM CR2: OIS1 (Bit 8) */
#define TIM_CR2_OIS1_Msk                                                   (0x100UL)    /*!< TIM CR2: OIS1 (Bitfield-Mask: 0x01) */
#define TIM_CR2_OIS1                                                       TIM_CR2_OIS1_Msk
#define TIM_CR2_TI1S_Pos                                                   (7UL)    /*!<TIM CR2: TI1S (Bit 7) */
#define TIM_CR2_TI1S_Msk                                                   (0x80UL)   /*!< TIM CR2: TI1S (Bitfield-Mask: 0x01) */
#define TIM_CR2_TI1S                                                       TIM_CR2_TI1S_Msk
#define TIM_CR2_CCDS_Pos                                                   (3UL)    /*!<TIM CR2: CCDS (Bit 3) */
#define TIM_CR2_CCDS_Msk                                                   (0x8UL)    /*!< TIM CR2: CCDS (Bitfield-Mask: 0x01) */
#define TIM_CR2_CCDS                                                       TIM_CR2_CCDS_Msk
#define TIM_CR2_CCUS_Pos                                                   (2UL)    /*!<TIM CR2: CCUS (Bit 2) */
#define TIM_CR2_CCUS_Msk                                                   (0x4UL)    /*!< TIM CR2: CCUS (Bitfield-Mask: 0x01) */
#define TIM_CR2_CCUS                                                       TIM_CR2_CCUS_Msk
#define TIM_CR2_CCPC_Pos                                                   (0UL)    /*!<TIM CR2: CCPC (Bit 0) */
#define TIM_CR2_CCPC_Msk                                                   (0x1UL)    /*!< TIM CR2: CCPC (Bitfield-Mask: 0x01) */
#define TIM_CR2_CCPC                                                       TIM_CR2_CCPC_Msk

/* =====================================================    SMCR    ===================================================== */
#define TIM_SMCR_ETP_Pos                                                   (15UL)   /*!<TIM SMCR: ETP (Bit 15) */
#define TIM_SMCR_ETP_Msk                                                   (0x8000UL)   /*!< TIM SMCR: ETP (Bitfield-Mask: 0x01) */
#define TIM_SMCR_ETP                                                       TIM_SMCR_ETP_Msk
#define TIM_SMCR_ECE_Pos                                                   (14UL)   /*!<TIM SMCR: ECE (Bit 14) */
#define TIM_SMCR_ECE_Msk                                                   (0x4000UL)   /*!< TIM SMCR: ECE (Bitfield-Mask: 0x01) */
#define TIM_SMCR_ECE                                                       TIM_SMCR_ECE_Msk
#define TIM_SMCR_ETPS_Pos                                                  (12UL)   /*!<TIM SMCR: ETPS (Bit 12) */
#define TIM_SMCR_ETPS_Msk                                                  (0x3000UL)   /*!< TIM SMCR: ETPS (Bitfield-Mask: 0x03) */
#define TIM_SMCR_ETPS                                                      TIM_SMCR_ETPS_Msk
#define TIM_SMCR_ETPS_0                                                    (0x1U << TIM_SMCR_ETPS_Pos)
#define TIM_SMCR_ETPS_1                                                    (0x2U << TIM_SMCR_ETPS_Pos)
#define TIM_SMCR_ETF_Pos                                                   (8UL)    /*!<TIM SMCR: ETF (Bit 8) */
#define TIM_SMCR_ETF_Msk                                                   (0xf00UL)    /*!< TIM SMCR: ETF (Bitfield-Mask: 0x0f) */
#define TIM_SMCR_ETF                                                       TIM_SMCR_ETF_Msk
#define TIM_SMCR_ETF_0                                                     (0x1U << TIM_SMCR_ETF_Pos)
#define TIM_SMCR_ETF_1                                                     (0x2U << TIM_SMCR_ETF_Pos)
#define TIM_SMCR_ETF_2                                                     (0x4U << TIM_SMCR_ETF_Pos)
#define TIM_SMCR_ETF_3                                                     (0x8U << TIM_SMCR_ETF_Pos)
#define TIM_SMCR_TS_Pos                                                    (4UL)    /*!<TIM SMCR: TS (Bit 4) */
#define TIM_SMCR_TS_Msk                                                    (0x70UL)   /*!< TIM SMCR: TS (Bitfield-Mask: 0x07) */
#define TIM_SMCR_TS                                                        TIM_SMCR_TS_Msk
#define TIM_SMCR_TS_0                                                      (0x1U << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_1                                                      (0x2U << TIM_SMCR_TS_Pos)
#define TIM_SMCR_TS_2                                                      (0x4U << TIM_SMCR_TS_Pos)
#define TIM_SMCR_OCCS_Pos                                                  (3UL)    /*!<TIM SMCR: OCCS (Bit 3) */
#define TIM_SMCR_OCCS_Msk                                                  (0x8UL)    /*!< TIM SMCR: OCCS (Bitfield-Mask: 0x01) */
#define TIM_SMCR_OCCS                                                      TIM_SMCR_OCCS_Msk
#define TIM_SMCR_SMS_Pos                                                   (0UL)    /*!<TIM SMCR: SMS (Bit 0) */
#define TIM_SMCR_SMS_Msk                                                   (0x10007UL)    /*!< TIM SMCR: SMS (Bitfield-Mask: 0x10007) */
#define TIM_SMCR_SMS                                                       TIM_SMCR_SMS_Msk
#define TIM_SMCR_SMS_0                                                     (0x1U << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_1                                                     (0x2U << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_2                                                     (0x4U << TIM_SMCR_SMS_Pos)
#define TIM_SMCR_SMS_3                                                     (0x10000U << TIM_SMCR_SMS_Pos)

/* =====================================================    DIER    ===================================================== */
#define TIM_DIER_CC4DE_Pos                                                 (12UL)   /*!<TIM DIER: CC4DE (Bit 12) */
#define TIM_DIER_CC4DE_Msk                                                 (0x1000UL)   /*!< TIM DIER: CC4DE (Bitfield-Mask: 0x01) */
#define TIM_DIER_CC4DE                                                     TIM_DIER_CC4DE_Msk
#define TIM_DIER_CC3DE_Pos                                                 (11UL)   /*!<TIM DIER: CC3DE (Bit 11) */
#define TIM_DIER_CC3DE_Msk                                                 (0x800UL)    /*!< TIM DIER: CC3DE (Bitfield-Mask: 0x01) */
#define TIM_DIER_CC3DE                                                     TIM_DIER_CC3DE_Msk
#define TIM_DIER_CC2DE_Pos                                                 (10UL)   /*!<TIM DIER: CC2DE (Bit 10) */
#define TIM_DIER_CC2DE_Msk                                                 (0x400UL)    /*!< TIM DIER: CC2DE (Bitfield-Mask: 0x01) */
#define TIM_DIER_CC2DE                                                     TIM_DIER_CC2DE_Msk
#define TIM_DIER_CC1DE_Pos                                                 (9UL)    /*!<TIM DIER: CC1DE (Bit 9) */
#define TIM_DIER_CC1DE_Msk                                                 (0x200UL)    /*!< TIM DIER: CC1DE (Bitfield-Mask: 0x01) */
#define TIM_DIER_CC1DE                                                     TIM_DIER_CC1DE_Msk
#define TIM_DIER_UDE_Pos                                                   (8UL)    /*!<TIM DIER: UDE (Bit 8) */
#define TIM_DIER_UDE_Msk                                                   (0x100UL)    /*!< TIM DIER: UDE (Bitfield-Mask: 0x01) */
#define TIM_DIER_UDE                                                       TIM_DIER_UDE_Msk
#define TIM_DIER_BIE_Pos                                                   (7UL)    /*!<TIM DIER: BIE (Bit 7) */
#define TIM_DIER_BIE_Msk                                                   (0x80UL)   /*!< TIM DIER: BIE (Bitfield-Mask: 0x01) */
#define TIM_DIER_BIE                                                       TIM_DIER_BIE_Msk
#define TIM_DIER_TIE_Pos                                                   (6UL)    /*!<TIM DIER: TIE (Bit 6) */
#define TIM_DIER_TIE_Msk                                                   (0x40UL)   /*!< TIM DIER: TIE (Bitfield-Mask: 0x01) */
#define TIM_DIER_TIE                                                       TIM_DIER_TIE_Msk
#define TIM_DIER_COMIE_Pos                                                 (5UL)    /*!<TIM DIER: COMIE (Bit 5) */
#define TIM_DIER_COMIE_Msk                                                 (0x20UL)   /*!< TIM DIER: COMIE (Bitfield-Mask: 0x01) */
#define TIM_DIER_COMIE                                                     TIM_DIER_COMIE_Msk
#define TIM_DIER_CC4IE_Pos                                                 (4UL)    /*!<TIM DIER: CC4IE (Bit 4) */
#define TIM_DIER_CC4IE_Msk                                                 (0x10UL)   /*!< TIM DIER: CC4IE (Bitfield-Mask: 0x01) */
#define TIM_DIER_CC4IE                                                     TIM_DIER_CC4IE_Msk
#define TIM_DIER_CC3IE_Pos                                                 (3UL)    /*!<TIM DIER: CC3IE (Bit 3) */
#define TIM_DIER_CC3IE_Msk                                                 (0x8UL)    /*!< TIM DIER: CC3IE (Bitfield-Mask: 0x01) */
#define TIM_DIER_CC3IE                                                     TIM_DIER_CC3IE_Msk
#define TIM_DIER_CC2IE_Pos                                                 (2UL)    /*!<TIM DIER: CC2IE (Bit 2) */
#define TIM_DIER_CC2IE_Msk                                                 (0x4UL)    /*!< TIM DIER: CC2IE (Bitfield-Mask: 0x01) */
#define TIM_DIER_CC2IE                                                     TIM_DIER_CC2IE_Msk
#define TIM_DIER_CC1IE_Pos                                                 (1UL)    /*!<TIM DIER: CC1IE (Bit 1) */
#define TIM_DIER_CC1IE_Msk                                                 (0x2UL)    /*!< TIM DIER: CC1IE (Bitfield-Mask: 0x01) */
#define TIM_DIER_CC1IE                                                     TIM_DIER_CC1IE_Msk
#define TIM_DIER_UIE_Pos                                                   (0UL)    /*!<TIM DIER: UIE (Bit 0) */
#define TIM_DIER_UIE_Msk                                                   (0x1UL)    /*!< TIM DIER: UIE (Bitfield-Mask: 0x01) */
#define TIM_DIER_UIE                                                       TIM_DIER_UIE_Msk

/* =====================================================    SR    ===================================================== */
#define TIM_SR_CC4OF_Pos                                                   (12UL)   /*!<TIM SR: CC4OF (Bit 12) */
#define TIM_SR_CC4OF_Msk                                                   (0x1000UL)   /*!< TIM SR: CC4OF (Bitfield-Mask: 0x01) */
#define TIM_SR_CC4OF                                                       TIM_SR_CC4OF_Msk
#define TIM_SR_CC3OF_Pos                                                   (11UL)   /*!<TIM SR: CC3OF (Bit 11) */
#define TIM_SR_CC3OF_Msk                                                   (0x800UL)    /*!< TIM SR: CC3OF (Bitfield-Mask: 0x01) */
#define TIM_SR_CC3OF                                                       TIM_SR_CC3OF_Msk
#define TIM_SR_CC2OF_Pos                                                   (10UL)   /*!<TIM SR: CC2OF (Bit 10) */
#define TIM_SR_CC2OF_Msk                                                   (0x400UL)    /*!< TIM SR: CC2OF (Bitfield-Mask: 0x01) */
#define TIM_SR_CC2OF                                                       TIM_SR_CC2OF_Msk
#define TIM_SR_CC1OF_Pos                                                   (9UL)    /*!<TIM SR: CC1OF (Bit 9) */
#define TIM_SR_CC1OF_Msk                                                   (0x200UL)    /*!< TIM SR: CC1OF (Bitfield-Mask: 0x01) */
#define TIM_SR_CC1OF                                                       TIM_SR_CC1OF_Msk
#define TIM_SR_BIF_Pos                                                     (7UL)    /*!<TIM SR: BIF (Bit 7) */
#define TIM_SR_BIF_Msk                                                     (0x80UL)   /*!< TIM SR: BIF (Bitfield-Mask: 0x01) */
#define TIM_SR_BIF                                                         TIM_SR_BIF_Msk
#define TIM_SR_TIF_Pos                                                     (6UL)    /*!<TIM SR: TIF (Bit 6) */
#define TIM_SR_TIF_Msk                                                     (0x40UL)   /*!< TIM SR: TIF (Bitfield-Mask: 0x01) */
#define TIM_SR_TIF                                                         TIM_SR_TIF_Msk
#define TIM_SR_COMIF_Pos                                                   (5UL)    /*!<TIM SR: COMIF (Bit 5) */
#define TIM_SR_COMIF_Msk                                                   (0x20UL)   /*!< TIM SR: COMIF (Bitfield-Mask: 0x01) */
#define TIM_SR_COMIF                                                       TIM_SR_COMIF_Msk
#define TIM_SR_CC4IF_Pos                                                   (4UL)    /*!<TIM SR: CC4IF (Bit 4) */
#define TIM_SR_CC4IF_Msk                                                   (0x10UL)   /*!< TIM SR: CC4IF (Bitfield-Mask: 0x01) */
#define TIM_SR_CC4IF                                                       TIM_SR_CC4IF_Msk
#define TIM_SR_CC3IF_Pos                                                   (3UL)    /*!<TIM SR: CC3IF (Bit 3) */
#define TIM_SR_CC3IF_Msk                                                   (0x8UL)    /*!< TIM SR: CC3IF (Bitfield-Mask: 0x01) */
#define TIM_SR_CC3IF                                                       TIM_SR_CC3IF_Msk
#define TIM_SR_CC2IF_Pos                                                   (2UL)    /*!<TIM SR: CC2IF (Bit 2) */
#define TIM_SR_CC2IF_Msk                                                   (0x4UL)    /*!< TIM SR: CC2IF (Bitfield-Mask: 0x01) */
#define TIM_SR_CC2IF                                                       TIM_SR_CC2IF_Msk
#define TIM_SR_CC1IF_Pos                                                   (1UL)    /*!<TIM SR: CC1IF (Bit 1) */
#define TIM_SR_CC1IF_Msk                                                   (0x2UL)    /*!< TIM SR: CC1IF (Bitfield-Mask: 0x01) */
#define TIM_SR_CC1IF                                                       TIM_SR_CC1IF_Msk
#define TIM_SR_UIF_Pos                                                     (0UL)    /*!<TIM SR: UIF (Bit 0) */
#define TIM_SR_UIF_Msk                                                     (0x1UL)    /*!< TIM SR: UIF (Bitfield-Mask: 0x01) */
#define TIM_SR_UIF                                                         TIM_SR_UIF_Msk

/* =====================================================    EGR    ===================================================== */
#define TIM_EGR_BG_Pos                                                     (7UL)    /*!<TIM EGR: BG (Bit 7) */
#define TIM_EGR_BG_Msk                                                     (0x80UL)   /*!< TIM EGR: BG (Bitfield-Mask: 0x01) */
#define TIM_EGR_BG                                                         TIM_EGR_BG_Msk
#define TIM_EGR_TG_Pos                                                     (6UL)    /*!<TIM EGR: TG (Bit 6) */
#define TIM_EGR_TG_Msk                                                     (0x40UL)   /*!< TIM EGR: TG (Bitfield-Mask: 0x01) */
#define TIM_EGR_TG                                                         TIM_EGR_TG_Msk
#define TIM_EGR_COMG_Pos                                                   (5UL)    /*!<TIM EGR: COMG (Bit 5) */
#define TIM_EGR_COMG_Msk                                                   (0x20UL)   /*!< TIM EGR: COMG (Bitfield-Mask: 0x01) */
#define TIM_EGR_COMG                                                       TIM_EGR_COMG_Msk
#define TIM_EGR_CC4G_Pos                                                   (4UL)    /*!<TIM EGR: CC4G (Bit 4) */
#define TIM_EGR_CC4G_Msk                                                   (0x10UL)   /*!< TIM EGR: CC4G (Bitfield-Mask: 0x01) */
#define TIM_EGR_CC4G                                                       TIM_EGR_CC4G_Msk
#define TIM_EGR_CC3G_Pos                                                   (3UL)    /*!<TIM EGR: CC3G (Bit 3) */
#define TIM_EGR_CC3G_Msk                                                   (0x8UL)    /*!< TIM EGR: CC3G (Bitfield-Mask: 0x01) */
#define TIM_EGR_CC3G                                                       TIM_EGR_CC3G_Msk
#define TIM_EGR_CC2G_Pos                                                   (2UL)    /*!<TIM EGR: CC2G (Bit 2) */
#define TIM_EGR_CC2G_Msk                                                   (0x4UL)    /*!< TIM EGR: CC2G (Bitfield-Mask: 0x01) */
#define TIM_EGR_CC2G                                                       TIM_EGR_CC2G_Msk
#define TIM_EGR_CC1G_Pos                                                   (1UL)    /*!<TIM EGR: CC1G (Bit 1) */
#define TIM_EGR_CC1G_Msk                                                   (0x2UL)    /*!< TIM EGR: CC1G (Bitfield-Mask: 0x01) */
#define TIM_EGR_CC1G                                                       TIM_EGR_CC1G_Msk
#define TIM_EGR_UG_Pos                                                     (0UL)    /*!<TIM EGR: UG (Bit 0) */
#define TIM_EGR_UG_Msk                                                     (0x1UL)    /*!< TIM EGR: UG (Bitfield-Mask: 0x01) */
#define TIM_EGR_UG                                                         TIM_EGR_UG_Msk

