stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    CCR2    ===================================================== */
#define TIM_CCR2_CCR2_Pos                                                  (0UL)    /*!<TIM CCR2: CCR2 (Bit 0) */
#define TIM_CCR2_CCR2_Msk                                                  (0xffffUL)   /*!< TIM CCR2: CCR2 (Bitfield-Mask: 0xffff) */
#define TIM_CCR2_CCR2                                                      TIM_CCR2_CCR2_Msk
#define TIM_CCR2_CCR2_0                                                    (0x1U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_1                                                    (0x2U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_2                                                    (0x4U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_3                                                    (0x8U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_4                                                    (0x10U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_5                                                    (0x20U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_6                                                    (0x40U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_7                                                    (0x80U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_8                                                    (0x100U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_9                                                    (0x200U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_10                                                   (0x400U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_11                                                   (0x800U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_12                                                   (0x1000U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_13                                                   (0x2000U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_14                                                   (0x4000U << TIM_CCR2_CCR2_Pos)
#define TIM_CCR2_CCR2_15                                                   (0x8000U << TIM_CCR2_CCR2_Pos)

/* =====================================================    CCR3    ===================================================== */
#define TIM_CCR3_CCR3_Pos                                                  (0UL)    /*!<TIM CCR3: CCR3 (Bit 0) */
#define TIM_CCR3_CCR3_Msk                                                  (0xffffUL)   /*!< TIM CCR3: CCR3 (Bitfield-Mask: 0xffff) */
#define TIM_CCR3_CCR3                                                      TIM_CCR3_CCR3_Msk
#define TIM_CCR3_CCR3_0                                                    (0x1U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_1                                                    (0x2U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_2                                                    (0x4U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_3                                                    (0x8U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_4                                                    (0x10U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_5                                                    (0x20U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_6                                                    (0x40U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_7                                                    (0x80U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_8                                                    (0x100U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_9                                                    (0x200U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_10                                                   (0x400U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_11                                                   (0x800U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_12                                                   (0x1000U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_13                                                   (0x2000U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_14                                                   (0x4000U << TIM_CCR3_CCR3_Pos)
#define TIM_CCR3_CCR3_15                                                   (0x8000U << TIM_CCR3_CCR3_Pos)

/* =====================================================    CCR4    ===================================================== */
#define TIM_CCR4_CCR4_Pos                                                  (0UL)    /*!<TIM CCR4: CCR4 (Bit 0) */
#define TIM_CCR4_CCR4_Msk                                                  (0xffffUL)   /*!< TIM CCR4: CCR4 (Bitfield-Mask: 0xffff) */
#define TIM_CCR4_CCR4                                                      TIM_CCR4_CCR4_Msk
#define TIM_CCR4_CCR4_0                                                    (0x1U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_1                                                    (0x2U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_2                                                    (0x4U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_3                                                    (0x8U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_4                                                    (0x10U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_5                                                    (0x20U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_6                                                    (0x40U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_7                                                    (0x80U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_8                                                    (0x100U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_9                                                    (0x200U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_10                                                   (0x400U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_11                                                   (0x800U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_12                                                   (0x1000U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_13                                                   (0x2000U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_14                                                   (0x4000U << TIM_CCR4_CCR4_Pos)
#define TIM_CCR4_CCR4_15                                                   (0x8000U << TIM_CCR4_CCR4_Pos)

