stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    BDTR    ===================================================== */
#define TIM_BDTR_BKBID_Pos                                                 (28UL)   /*!<TIM BDTR: BKBID (Bit 28) */
#define TIM_BDTR_BKBID_Msk                                                 (0x10000000UL)   /*!< TIM BDTR: BKBID (Bitfield-Mask: 0x01) */
#define TIM_BDTR_BKBID                                                     TIM_BDTR_BKBID_Msk
#define TIM_BDTR_BKDSRM_Pos                                                (26UL)   /*!<TIM BDTR: BKDSRM (Bit 26) */
#define TIM_BDTR_BKDSRM_Msk                                                (0x4000000UL)    /*!< TIM BDTR: BKDSRM (Bitfield-Mask: 0x01) */
#define TIM_BDTR_BKDSRM                                                    TIM_BDTR_BKDSRM_Msk
#define TIM_BDTR_MOE_Pos                                                   (15UL)   /*!<TIM BDTR: MOE (Bit 15) */
#define TIM_BDTR_MOE_Msk                                                   (0x8000UL)   /*!< TIM BDTR: MOE (Bitfield-Mask: 0x01) */
#define TIM_BDTR_MOE                                                       TIM_BDTR_MOE_Msk
#define TIM_BDTR_AOE_Pos                                                   (14UL)   /*!<TIM BDTR: AOE (Bit 14) */
#define TIM_BDTR_AOE_Msk                                                   (0x4000UL)   /*!< TIM BDTR: AOE (Bitfield-Mask: 0x01) */
#define TIM_BDTR_AOE                                                       TIM_BDTR_AOE_Msk
#define TIM_BDTR_BKP_Pos                                                   (13UL)   /*!<TIM BDTR: BKP (Bit 13) */
#define TIM_BDTR_BKP_Msk                                                   (0x2000UL)   /*!< TIM BDTR: BKP (Bitfield-Mask: 0x01) */
#define TIM_BDTR_BKP                                                       TIM_BDTR_BKP_Msk
#define TIM_BDTR_BKE_Pos                                                   (12UL)   /*!<TIM BDTR: BKE (Bit 12) */
#define TIM_BDTR_BKE_Msk                                                   (0x1000UL)   /*!< TIM BDTR: BKE (Bitfield-Mask: 0x01) */
#define TIM_BDTR_BKE                                                       TIM_BDTR_BKE_Msk
#define TIM_BDTR_OSSR_Pos                                                  (11UL)   /*!<TIM BDTR: OSSR (Bit 11) */
#define TIM_BDTR_OSSR_Msk                                                  (0x800UL)    /*!< TIM BDTR: OSSR (Bitfield-Mask: 0x01) */
#define TIM_BDTR_OSSR                                                      TIM_BDTR_OSSR_Msk
#define TIM_BDTR_OSSI_Pos                                                  (10UL)   /*!<TIM BDTR: OSSI (Bit 10) */
#define TIM_BDTR_OSSI_Msk                                                  (0x400UL)    /*!< TIM BDTR: OSSI (Bitfield-Mask: 0x01) */
#define TIM_BDTR_OSSI                                                      TIM_BDTR_OSSI_Msk
#define TIM_BDTR_LOCK_Pos                                                  (8UL)    /*!<TIM BDTR: LOCK (Bit 8) */
#define TIM_BDTR_LOCK_Msk                                                  (0x300UL)    /*!< TIM BDTR: LOCK (Bitfield-Mask: 0x03) */
#define TIM_BDTR_LOCK                                                      TIM_BDTR_LOCK_Msk
#define TIM_BDTR_LOCK_0                                                    (0x1U << TIM_BDTR_LOCK_Pos)
#define TIM_BDTR_LOCK_1                                                    (0x2U << TIM_BDTR_LOCK_Pos)
#define TIM_BDTR_DTG_Pos                                                   (0UL)    /*!<TIM BDTR: DTG (Bit 0) */
#define TIM_BDTR_DTG_Msk                                                   (0xffUL)   /*!< TIM BDTR: DTG (Bitfield-Mask: 0xff) */
#define TIM_BDTR_DTG                                                       TIM_BDTR_DTG_Msk
#define TIM_BDTR_DTG_0                                                     (0x1U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_1                                                     (0x2U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_2                                                     (0x4U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_3                                                     (0x8U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_4                                                     (0x10U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_5                                                     (0x20U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_6                                                     (0x40U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_7                                                     (0x80U << TIM_BDTR_DTG_Pos)

/* =====================================================    DCR    ===================================================== */
#define TIM_DCR_DBL_Pos                                                    (8UL)    /*!<TIM DCR: DBL (Bit 8) */
#define TIM_DCR_DBL_Msk                                                    (0x1f00UL)   /*!< TIM DCR: DBL (Bitfield-Mask: 0x1f) */
#define TIM_DCR_DBL                                                        TIM_DCR_DBL_Msk
#define TIM_DCR_DBL_0                                                      (0x1U << TIM_DCR_DBL_Pos)
#define TIM_DCR_DBL_1                                                      (0x2U << TIM_DCR_DBL_Pos)
#define TIM_DCR_DBL_2                                                      (0x4U << TIM_DCR_DBL_Pos)
#define TIM_DCR_DBL_3                                                      (0x8U << TIM_DCR_DBL_Pos)
#define TIM_DCR_DBL_4                                                      (0x10U << TIM_DCR_DBL_Pos)
#define TIM_DCR_DBA_Pos                                                    (0UL)    /*!<TIM DCR: DBA (Bit 0) */
#define TIM_DCR_DBA_Msk                                                    (0x1fUL)   /*!< TIM DCR: DBA (Bitfield-Mask: 0x1f) */
#define TIM_DCR_DBA                                                        TIM_DCR_DBA_Msk
#define TIM_DCR_DBA_0                                                      (0x1U << TIM_DCR_DBA_Pos)
#define TIM_DCR_DBA_1                                                      (0x2U << TIM_DCR_DBA_Pos)
#define TIM_DCR_DBA_2                                                      (0x4U << TIM_DCR_DBA_Pos)
#define TIM_DCR_DBA_3                                                      (0x8U << TIM_DCR_DBA_Pos)
#define TIM_DCR_DBA_4                                                      (0x10U << TIM_DCR_DBA_Pos)

/* =====================================================    DMAR    ===================================================== */
#define TIM_DMAR_DMAB_Pos                                                  (0UL)    /*!<TIM DMAR: DMAB (Bit 0) */
#define TIM_DMAR_DMAB_Msk                                                  (0xffffUL)   /*!< TIM DMAR: DMAB (Bitfield-Mask: 0xffff) */
#define TIM_DMAR_DMAB                                                      TIM_DMAR_DMAB_Msk
#define TIM_DMAR_DMAB_0                                                    (0x1U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_1                                                    (0x2U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_2                                                    (0x4U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_3                                                    (0x8U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_4                                                    (0x10U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_5                                                    (0x20U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_6                                                    (0x40U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_7                                                    (0x80U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_8                                                    (0x100U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_9                                                    (0x200U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_10                                                   (0x400U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_11                                                   (0x800U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_12                                                   (0x1000U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_13                                                   (0x2000U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_14                                                   (0x4000U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_15                                                   (0x8000U << TIM_DMAR_DMAB_Pos)

/* =====================================================    OR1    ===================================================== */
#define TIM_OR1_TI1_RMP_Pos                                                (0UL)    /*!<TIM OR1: TI1_RMP (Bit 0) */
#define TIM_OR1_TI1_RMP_Msk                                                (0x3UL)    /*!< TIM OR1: TI1_RMP (Bitfield-Mask: 0x03) */
#define TIM_OR1_TI1_RMP                                                    TIM_OR1_TI1_RMP_Msk
#define TIM_OR1_TI1_RMP_0                                                  (0x1U << TIM_OR1_TI1_RMP_Pos)
#define TIM_OR1_TI1_RMP_1                                                  (0x2U << TIM_OR1_TI1_RMP_Pos)

/* =====================================================    AF1    ===================================================== */
#define TIM_AF1_BKCMP2P_Pos                                                (11UL)   /*!<TIM AF1: BKCMP2P (Bit 11) */
#define TIM_AF1_BKCMP2P_Msk                                                (0x800UL)    /*!< TIM AF1: BKCMP2P (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKCMP2P                                                    TIM_AF1_BKCMP2P_Msk
#define TIM_AF1_BKCMP1P_Pos                                                (10UL)   /*!<TIM AF1: BKCMP1P (Bit 10) */
#define TIM_AF1_BKCMP1P_Msk                                                (0x400UL)    /*!< TIM AF1: BKCMP1P (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKCMP1P                                                    TIM_AF1_BKCMP1P_Msk
#define TIM_AF1_BKINP_Pos                                                  (9UL)    /*!<TIM AF1: BKINP (Bit 9) */
#define TIM_AF1_BKINP_Msk                                                  (0x200UL)    /*!< TIM AF1: BKINP (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKINP                                                      TIM_AF1_BKINP_Msk
#define TIM_AF1_BKCMP2E_Pos                                                (2UL)    /*!<TIM AF1: BKCMP2E (Bit 2) */
#define TIM_AF1_BKCMP2E_Msk                                                (0x4UL)    /*!< TIM AF1: BKCMP2E (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKCMP2E                                                    TIM_AF1_BKCMP2E_Msk
#define TIM_AF1_BKCMP1E_Pos                                                (1UL)    /*!<TIM AF1: BKCMP1E (Bit 1) */
#define TIM_AF1_BKCMP1E_Msk                                                (0x2UL)    /*!< TIM AF1: BKCMP1E (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKCMP1E                                                    TIM_AF1_BKCMP1E_Msk
#define TIM_AF1_BKINE_Pos                                                  (0UL)    /*!<TIM AF1: BKINE (Bit 0) */
#define TIM_AF1_BKINE_Msk                                                  (0x1UL)    /*!< TIM AF1: BKINE (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKINE                                                      TIM_AF1_BKINE_Msk

