stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    CALR    ===================================================== */
#define RTC_CALR_CALP_Pos                                                  (15UL)   /*!<RTC CALR: CALP (Bit 15) */
#define RTC_CALR_CALP_Msk                                                  (0x8000UL)   /*!< RTC CALR: CALP (Bitfield-Mask: 0x01) */
#define RTC_CALR_CALP                                                      RTC_CALR_CALP_Msk
#define RTC_CALR_CALW8_Pos                                                 (14UL)   /*!<RTC CALR: CALW8 (Bit 14) */
#define RTC_CALR_CALW8_Msk                                                 (0x4000UL)   /*!< RTC CALR: CALW8 (Bitfield-Mask: 0x01) */
#define RTC_CALR_CALW8                                                     RTC_CALR_CALW8_Msk
#define RTC_CALR_CALW16_Pos                                                (13UL)   /*!<RTC CALR: CALW16 (Bit 13) */
#define RTC_CALR_CALW16_Msk                                                (0x2000UL)   /*!< RTC CALR: CALW16 (Bitfield-Mask: 0x01) */
#define RTC_CALR_CALW16                                                    RTC_CALR_CALW16_Msk
#define RTC_CALR_CALM_Pos                                                  (0UL)    /*!<RTC CALR: CALM (Bit 0) */
#define RTC_CALR_CALM_Msk                                                  (0x1ffUL)    /*!< RTC CALR: CALM (Bitfield-Mask: 0x1ff) */
#define RTC_CALR_CALM                                                      RTC_CALR_CALM_Msk
#define RTC_CALR_CALM_0                                                    (0x1U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_1                                                    (0x2U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_2                                                    (0x4U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_3                                                    (0x8U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_4                                                    (0x10U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_5                                                    (0x20U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_6                                                    (0x40U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_7                                                    (0x80U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_8                                                    (0x100U << RTC_CALR_CALM_Pos)

/* =====================================================    ALRMASSR    ===================================================== */
#define RTC_ALRMASSR_MASKSS_Pos                                            (24UL)   /*!<RTC ALRMASSR: MASKSS (Bit 24) */
#define RTC_ALRMASSR_MASKSS_Msk                                            (0xf000000UL)    /*!< RTC ALRMASSR: MASKSS (Bitfield-Mask: 0x0f) */
#define RTC_ALRMASSR_MASKSS                                                RTC_ALRMASSR_MASKSS_Msk
#define RTC_ALRMASSR_MASKSS_0                                              (0x1U << RTC_ALRMASSR_MASKSS_Pos)
#define RTC_ALRMASSR_MASKSS_1                                              (0x2U << RTC_ALRMASSR_MASKSS_Pos)
#define RTC_ALRMASSR_MASKSS_2                                              (0x4U << RTC_ALRMASSR_MASKSS_Pos)
#define RTC_ALRMASSR_MASKSS_3                                              (0x8U << RTC_ALRMASSR_MASKSS_Pos)
#define RTC_ALRMASSR_SS_Pos                                                (0UL)    /*!<RTC ALRMASSR: SS (Bit 0) */
#define RTC_ALRMASSR_SS_Msk                                                (0x7fffUL)   /*!< RTC ALRMASSR: SS (Bitfield-Mask: 0x7fff) */
#define RTC_ALRMASSR_SS                                                    RTC_ALRMASSR_SS_Msk
#define RTC_ALRMASSR_SS_0                                                  (0x1U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_1                                                  (0x2U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_2                                                  (0x4U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_3                                                  (0x8U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_4                                                  (0x10U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_5                                                  (0x20U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_6                                                  (0x40U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_7                                                  (0x80U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_8                                                  (0x100U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_9                                                  (0x200U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_10                                                 (0x400U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_11                                                 (0x800U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_12                                                 (0x1000U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_13                                                 (0x2000U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_14                                                 (0x4000U << RTC_ALRMASSR_SS_Pos)

/* =====================================================    BKP0R    ===================================================== */
#define RTC_BKP0R_BKP_Pos                                                  (0UL)    /*!<RTC BKP0R: BKP (Bit 0) */
#define RTC_BKP0R_BKP_Msk                                                  (0xffffffffUL)   /*!< RTC BKP0R: BKP (Bitfield-Mask: 0xffffffff) */
#define RTC_BKP0R_BKP                                                      RTC_BKP0R_BKP_Msk
#define RTC_BKP0R_BKP_0                                                    (0x1U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_1                                                    (0x2U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_2                                                    (0x4U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_3                                                    (0x8U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_4                                                    (0x10U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_5                                                    (0x20U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_6                                                    (0x40U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_7                                                    (0x80U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_8                                                    (0x100U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_9                                                    (0x200U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_10                                                   (0x400U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_11                                                   (0x800U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_12                                                   (0x1000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_13                                                   (0x2000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_14                                                   (0x4000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_15                                                   (0x8000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_16                                                   (0x10000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_17                                                   (0x20000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_18                                                   (0x40000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_19                                                   (0x80000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_20                                                   (0x100000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_21                                                   (0x200000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_22                                                   (0x400000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_23                                                   (0x800000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_24                                                   (0x1000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_25                                                   (0x2000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_26                                                   (0x4000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_27                                                   (0x8000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_28                                                   (0x10000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_29                                                   (0x20000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_30                                                   (0x40000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_31                                                   (0x80000000UL << RTC_BKP0R_BKP_Pos)

/* =====================================================    BKP1R    ===================================================== */
#define RTC_BKP1R_BKP_Pos                                                  (0UL)    /*!<RTC BKP1R: BKP (Bit 0) */
#define RTC_BKP1R_BKP_Msk                                                  (0xffffffffUL)   /*!< RTC BKP1R: BKP (Bitfield-Mask: 0xffffffff) */
#define RTC_BKP1R_BKP                                                      RTC_BKP1R_BKP_Msk
#define RTC_BKP1R_BKP_0                                                    (0x1U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_1                                                    (0x2U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_2                                                    (0x4U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_3                                                    (0x8U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_4                                                    (0x10U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_5                                                    (0x20U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_6                                                    (0x40U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_7                                                    (0x80U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_8                                                    (0x100U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_9                                                    (0x200U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_10                                                   (0x400U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_11                                                   (0x800U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_12                                                   (0x1000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_13                                                   (0x2000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_14                                                   (0x4000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_15                                                   (0x8000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_16                                                   (0x10000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_17                                                   (0x20000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_18                                                   (0x40000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_19                                                   (0x80000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_20                                                   (0x100000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_21                                                   (0x200000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_22                                                   (0x400000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_23                                                   (0x800000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_24                                                   (0x1000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_25                                                   (0x2000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_26                                                   (0x4000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_27                                                   (0x8000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_28                                                   (0x10000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_29                                                   (0x20000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_30                                                   (0x40000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_31                                                   (0x80000000UL << RTC_BKP1R_BKP_Pos)

