stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    IRQ_ENABLE    ===================================================== */
#define ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA_Pos                                  (5UL)    /*!<ADC IRQ_ENABLE: OVR_DS_IRQ_ENA (Bit 5) */
#define ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA_Msk                                  (0x20UL)   /*!< ADC IRQ_ENABLE: OVR_DS_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA                                      ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_AWD_IRQ_ENA_Pos                                     (4UL)    /*!<ADC IRQ_ENABLE: AWD_IRQ_ENA (Bit 4) */
#define ADC_IRQ_ENABLE_AWD_IRQ_ENA_Msk                                     (0x10UL)   /*!< ADC IRQ_ENABLE: AWD_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_AWD_IRQ_ENA                                         ADC_IRQ_ENABLE_AWD_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_EOS_IRQ_ENA_Pos                                     (3UL)    /*!<ADC IRQ_ENABLE: EOS_IRQ_ENA (Bit 3) */
#define ADC_IRQ_ENABLE_EOS_IRQ_ENA_Msk                                     (0x8UL)    /*!< ADC IRQ_ENABLE: EOS_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_EOS_IRQ_ENA                                         ADC_IRQ_ENABLE_EOS_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_EODS_IRQ_ENA_Pos                                    (1UL)    /*!<ADC IRQ_ENABLE: EODS_IRQ_ENA (Bit 1) */
#define ADC_IRQ_ENABLE_EODS_IRQ_ENA_Msk                                    (0x2UL)    /*!< ADC IRQ_ENABLE: EODS_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_EODS_IRQ_ENA                                        ADC_IRQ_ENABLE_EODS_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_EOC_IRQ_ENA_Pos                                     (0UL)    /*!<ADC IRQ_ENABLE: EOC_IRQ_ENA (Bit 0) */
#define ADC_IRQ_ENABLE_EOC_IRQ_ENA_Msk                                     (0x1UL)    /*!< ADC IRQ_ENABLE: EOC_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_EOC_IRQ_ENA                                         ADC_IRQ_ENABLE_EOC_IRQ_ENA_Msk

/* =====================================================    TIMER_CONF    ===================================================== */
#define ADC_TIMER_CONF_ADC_LDO_DELAY_Pos                                   (0UL)    /*!<ADC TIMER_CONF: ADC_LDO_DELAY (Bit 0) */
#define ADC_TIMER_CONF_ADC_LDO_DELAY_Msk                                   (0xffUL)   /*!< ADC TIMER_CONF: ADC_LDO_DELAY (Bitfield-Mask: 0xff) */
#define ADC_TIMER_CONF_ADC_LDO_DELAY                                       ADC_TIMER_CONF_ADC_LDO_DELAY_Msk
#define ADC_TIMER_CONF_ADC_LDO_DELAY_0                                     (0x1U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_1                                     (0x2U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_2                                     (0x4U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_3                                     (0x8U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_4                                     (0x10U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_5                                     (0x20U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_6                                     (0x40U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_7                                     (0x80U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)


/* =========================================================================================================================== */
/*=====================                                       BLUE                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    INTERRUPT1REG    ===================================================== */
#define BLUE_INTERRUPT1REG_RCVOK_Pos                                       (31UL)   /*!<BLUE INTERRUPT1REG: RCVOK (Bit 31) */
#define BLUE_INTERRUPT1REG_RCVOK_Msk                                       (0x80000000UL)   /*!< BLUE INTERRUPT1REG: RCVOK (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_RCVOK                                           BLUE_INTERRUPT1REG_RCVOK_Msk
#define BLUE_INTERRUPT1REG_RCVCRCERR_Pos                                   (30UL)   /*!<BLUE INTERRUPT1REG: RCVCRCERR (Bit 30) */
#define BLUE_INTERRUPT1REG_RCVCRCERR_Msk                                   (0x40000000UL)   /*!< BLUE INTERRUPT1REG: RCVCRCERR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_RCVCRCERR                                       BLUE_INTERRUPT1REG_RCVCRCERR_Msk
#define BLUE_INTERRUPT1REG_TIMECAPTURETRIG_Pos                             (29UL)   /*!<BLUE INTERRUPT1REG: TIMECAPTURETRIG (Bit 29) */
#define BLUE_INTERRUPT1REG_TIMECAPTURETRIG_Msk                             (0x20000000UL)   /*!< BLUE INTERRUPT1REG: TIMECAPTURETRIG (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_TIMECAPTURETRIG                                 BLUE_INTERRUPT1REG_TIMECAPTURETRIG_Msk
#define BLUE_INTERRUPT1REG_RCVCMD_Pos                                      (28UL)   /*!<BLUE INTERRUPT1REG: RCVCMD (Bit 28) */
#define BLUE_INTERRUPT1REG_RCVCMD_Msk                                      (0x10000000UL)   /*!< BLUE INTERRUPT1REG: RCVCMD (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_RCVCMD                                          BLUE_INTERRUPT1REG_RCVCMD_Msk
#define BLUE_INTERRUPT1REG_RCVNOMD_Pos                                     (27UL)   /*!<BLUE INTERRUPT1REG: RCVNOMD (Bit 27) */
#define BLUE_INTERRUPT1REG_RCVNOMD_Msk                                     (0x8000000UL)    /*!< BLUE INTERRUPT1REG: RCVNOMD (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_RCVNOMD                                         BLUE_INTERRUPT1REG_RCVNOMD_Msk
#define BLUE_INTERRUPT1REG_RCVTIMEOUT_Pos                                  (26UL)   /*!<BLUE INTERRUPT1REG: RCVTIMEOUT (Bit 26) */
#define BLUE_INTERRUPT1REG_RCVTIMEOUT_Msk                                  (0x4000000UL)    /*!< BLUE INTERRUPT1REG: RCVTIMEOUT (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_RCVTIMEOUT                                      BLUE_INTERRUPT1REG_RCVTIMEOUT_Msk
#define BLUE_INTERRUPT1REG_DONE_Pos                                        (25UL)   /*!<BLUE INTERRUPT1REG: DONE (Bit 25) */
#define BLUE_INTERRUPT1REG_DONE_Msk                                        (0x2000000UL)    /*!< BLUE INTERRUPT1REG: DONE (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_DONE                                            BLUE_INTERRUPT1REG_DONE_Msk
#define BLUE_INTERRUPT1REG_TXOK_Pos                                        (24UL)   /*!<BLUE INTERRUPT1REG: TXOK (Bit 24) */
#define BLUE_INTERRUPT1REG_TXOK_Msk                                        (0x1000000UL)    /*!< BLUE INTERRUPT1REG: TXOK (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_TXOK                                            BLUE_INTERRUPT1REG_TXOK_Msk
#define BLUE_INTERRUPT1REG_CONFIGERROR_Pos                                 (23UL)   /*!<BLUE INTERRUPT1REG: CONFIGERROR (Bit 23) */
#define BLUE_INTERRUPT1REG_CONFIGERROR_Msk                                 (0x800000UL)   /*!< BLUE INTERRUPT1REG: CONFIGERROR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_CONFIGERROR                                     BLUE_INTERRUPT1REG_CONFIGERROR_Msk
#define BLUE_INTERRUPT1REG_ACTIVE2ERROR_Pos                                (22UL)   /*!<BLUE INTERRUPT1REG: ACTIVE2ERROR (Bit 22) */
#define BLUE_INTERRUPT1REG_ACTIVE2ERROR_Msk                                (0x400000UL)   /*!< BLUE INTERRUPT1REG: ACTIVE2ERROR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_ACTIVE2ERROR                                    BLUE_INTERRUPT1REG_ACTIVE2ERROR_Msk
#define BLUE_INTERRUPT1REG_TXRXSKIP_Pos                                    (21UL)   /*!<BLUE INTERRUPT1REG: TXRXSKIP (Bit 21) */
#define BLUE_INTERRUPT1REG_TXRXSKIP_Msk                                    (0x200000UL)   /*!< BLUE INTERRUPT1REG: TXRXSKIP (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_TXRXSKIP                                        BLUE_INTERRUPT1REG_TXRXSKIP_Msk
#define BLUE_INTERRUPT1REG_SEMAWASPREEMPT_Pos                              (20UL)   /*!<BLUE INTERRUPT1REG: SEMAWASPREEMPT (Bit 20) */
#define BLUE_INTERRUPT1REG_SEMAWASPREEMPT_Msk                              (0x100000UL)   /*!< BLUE INTERRUPT1REG: SEMAWASPREEMPT (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_SEMAWASPREEMPT                                  BLUE_INTERRUPT1REG_SEMAWASPREEMPT_Msk
#define BLUE_INTERRUPT1REG_SEMATIMEOUTERROR_Pos                            (19UL)   /*!<BLUE INTERRUPT1REG: SEMATIMEOUTERROR (Bit 19) */
#define BLUE_INTERRUPT1REG_SEMATIMEOUTERROR_Msk                            (0x80000UL)    /*!< BLUE INTERRUPT1REG: SEMATIMEOUTERROR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_SEMATIMEOUTERROR                                BLUE_INTERRUPT1REG_SEMATIMEOUTERROR_Msk
#define BLUE_INTERRUPT1REG_RCVLENGTHERROR_Pos                              (18UL)   /*!<BLUE INTERRUPT1REG: RCVLENGTHERROR (Bit 18) */
#define BLUE_INTERRUPT1REG_RCVLENGTHERROR_Msk                              (0x40000UL)    /*!< BLUE INTERRUPT1REG: RCVLENGTHERROR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_RCVLENGTHERROR                                  BLUE_INTERRUPT1REG_RCVLENGTHERROR_Msk
#define BLUE_INTERRUPT1REG_NOACTIVELERROR_Pos                              (16UL)   /*!<BLUE INTERRUPT1REG: NOACTIVELERROR (Bit 16) */
#define BLUE_INTERRUPT1REG_NOACTIVELERROR_Msk                              (0x10000UL)    /*!< BLUE INTERRUPT1REG: NOACTIVELERROR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_NOACTIVELERROR                                  BLUE_INTERRUPT1REG_NOACTIVELERROR_Msk
#define BLUE_INTERRUPT1REG_TXDATAREADYERROR_Pos                            (15UL)   /*!<BLUE INTERRUPT1REG: TXDATAREADYERROR (Bit 15) */
#define BLUE_INTERRUPT1REG_TXDATAREADYERROR_Msk                            (0x8000UL)   /*!< BLUE INTERRUPT1REG: TXDATAREADYERROR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_TXDATAREADYERROR                                BLUE_INTERRUPT1REG_TXDATAREADYERROR_Msk
#define BLUE_INTERRUPT1REG_ALLTABLEREADYERROR_Pos                          (14UL)   /*!<BLUE INTERRUPT1REG: ALLTABLEREADYERROR (Bit 14) */
#define BLUE_INTERRUPT1REG_ALLTABLEREADYERROR_Msk                          (0x4000UL)   /*!< BLUE INTERRUPT1REG: ALLTABLEREADYERROR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_ALLTABLEREADYERROR                              BLUE_INTERRUPT1REG_ALLTABLEREADYERROR_Msk
#define BLUE_INTERRUPT1REG_ENCERROR_Pos                                    (13UL)   /*!<BLUE INTERRUPT1REG: ENCERROR (Bit 13) */
#define BLUE_INTERRUPT1REG_ENCERROR_Msk                                    (0x2000UL)   /*!< BLUE INTERRUPT1REG: ENCERROR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_ENCERROR                                        BLUE_INTERRUPT1REG_ENCERROR_Msk
#define BLUE_INTERRUPT1REG_TXERROR_4_Pos                                   (12UL)   /*!<BLUE INTERRUPT1REG: TXERROR_4 (Bit 12) */
#define BLUE_INTERRUPT1REG_TXERROR_4_Msk                                   (0x1000UL)   /*!< BLUE INTERRUPT1REG: TXERROR_4 (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_TXERROR_4                                       BLUE_INTERRUPT1REG_TXERROR_4_Msk
#define BLUE_INTERRUPT1REG_TXERROR_3_Pos                                   (11UL)   /*!<BLUE INTERRUPT1REG: TXERROR_3 (Bit 11) */
#define BLUE_INTERRUPT1REG_TXERROR_3_Msk                                   (0x800UL)    /*!< BLUE INTERRUPT1REG: TXERROR_3 (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_TXERROR_3                                       BLUE_INTERRUPT1REG_TXERROR_3_Msk
#define BLUE_INTERRUPT1REG_TXERROR_2_Pos                                   (10UL)   /*!<BLUE INTERRUPT1REG: TXERROR_2 (Bit 10) */
#define BLUE_INTERRUPT1REG_TXERROR_2_Msk                                   (0x400UL)    /*!< BLUE INTERRUPT1REG: TXERROR_2 (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_TXERROR_2                                       BLUE_INTERRUPT1REG_TXERROR_2_Msk
#define BLUE_INTERRUPT1REG_TXERROR_1_Pos                                   (9UL)    /*!<BLUE INTERRUPT1REG: TXERROR_1 (Bit 9) */
#define BLUE_INTERRUPT1REG_TXERROR_1_Msk                                   (0x200UL)    /*!< BLUE INTERRUPT1REG: TXERROR_1 (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_TXERROR_1                                       BLUE_INTERRUPT1REG_TXERROR_1_Msk
#define BLUE_INTERRUPT1REG_TXERROR_0_Pos                                   (8UL)    /*!<BLUE INTERRUPT1REG: TXERROR_0 (Bit 8) */
#define BLUE_INTERRUPT1REG_TXERROR_0_Msk                                   (0x100UL)    /*!< BLUE INTERRUPT1REG: TXERROR_0 (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_TXERROR_0                                       BLUE_INTERRUPT1REG_TXERROR_0_Msk
#define BLUE_INTERRUPT1REG_SEQDONE_Pos                                     (7UL)    /*!<BLUE INTERRUPT1REG: SEQDONE (Bit 7) */
#define BLUE_INTERRUPT1REG_SEQDONE_Msk                                     (0x80UL)   /*!< BLUE INTERRUPT1REG: SEQDONE (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_SEQDONE                                         BLUE_INTERRUPT1REG_SEQDONE_Msk
#define BLUE_INTERRUPT1REG_RXOVERFLOWERROR_Pos                             (5UL)    /*!<BLUE INTERRUPT1REG: RXOVERFLOWERROR (Bit 5) */
#define BLUE_INTERRUPT1REG_RXOVERFLOWERROR_Msk                             (0x20UL)   /*!< BLUE INTERRUPT1REG: RXOVERFLOWERROR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_RXOVERFLOWERROR                                 BLUE_INTERRUPT1REG_RXOVERFLOWERROR_Msk
#define BLUE_INTERRUPT1REG_ADDPOINTERROR_Pos                               (4UL)    /*!<BLUE INTERRUPT1REG: ADDPOINTERROR (Bit 4) */
#define BLUE_INTERRUPT1REG_ADDPOINTERROR_Msk                               (0x10UL)   /*!< BLUE INTERRUPT1REG: ADDPOINTERROR (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT1REG_ADDPOINTERROR                                   BLUE_INTERRUPT1REG_ADDPOINTERROR_Msk
#define BLUE_INTERRUPT1REG_ALL_Pos                                         (0UL)
#define BLUE_INTERRUPT1REG_ALL_Msk                                         (BLUE_INTERRUPT1REG_ADDPOINTERROR |\
                                                                            BLUE_INTERRUPT1REG_RXOVERFLOWERROR |\
                                                                            BLUE_INTERRUPT1REG_SEQDONE |\
                                                                            BLUE_INTERRUPT1REG_TXERROR_0 |\
                                                                            BLUE_INTERRUPT1REG_TXERROR_1 |\
                                                                            BLUE_INTERRUPT1REG_TXERROR_2 |\
                                                                            BLUE_INTERRUPT1REG_TXERROR_3 |\
                                                                            BLUE_INTERRUPT1REG_TXERROR_4 |\
                                                                            BLUE_INTERRUPT1REG_ENCERROR |\
                                                                            BLUE_INTERRUPT1REG_ALLTABLEREADYERROR |\
                                                                            BLUE_INTERRUPT1REG_TXDATAREADYERROR |\
                                                                            BLUE_INTERRUPT1REG_NOACTIVELERROR |\
                                                                            BLUE_INTERRUPT1REG_RCVLENGTHERROR |\
                                                                            BLUE_INTERRUPT1REG_SEMATIMEOUTERROR |\
                                                                            BLUE_INTERRUPT1REG_SEMAWASPREEMPT |\
                                                                            BLUE_INTERRUPT1REG_TXRXSKIP |\
                                                                            BLUE_INTERRUPT1REG_ACTIVE2ERROR |\
                                                                            BLUE_INTERRUPT1REG_CONFIGERROR |\
                                                                            BLUE_INTERRUPT1REG_TXOK |\
                                                                            BLUE_INTERRUPT1REG_DONE |\
                                                                            BLUE_INTERRUPT1REG_RCVTIMEOUT |\
                                                                            BLUE_INTERRUPT1REG_RCVNOMD |\
                                                                            BLUE_INTERRUPT1REG_RCVCMD |\
                                                                            BLUE_INTERRUPT1REG_TIMECAPTURETRIG | BLUE_INTERRUPT1REG_RCVCRCERR | BLUE_INTERRUPT1REG_RCVOK )
#define BLUE_INTERRUPT1REG_ALL                                             BLUE_INTERRUPT1REG_ALL_Msk

/* =====================================================    INTERRUPT2REG    ===================================================== */
#define BLUE_INTERRUPT2REG_AESLEPRIVINT_Pos                                (1UL)    /*!<BLUE INTERRUPT2REG: AESLEPRIVINT (Bit 1) */
#define BLUE_INTERRUPT2REG_AESLEPRIVINT_Msk                                (0x2UL)    /*!< BLUE INTERRUPT2REG: AESLEPRIVINT (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT2REG_AESLEPRIVINT                                    BLUE_INTERRUPT2REG_AESLEPRIVINT_Msk
#define BLUE_INTERRUPT2REG_AESMANENCINT_Pos                                (0UL)    /*!<BLUE INTERRUPT2REG: AESMANENCINT (Bit 0) */
#define BLUE_INTERRUPT2REG_AESMANENCINT_Msk                                (0x1UL)    /*!< BLUE INTERRUPT2REG: AESMANENCINT (Bitfield-Mask: 0x01) */
#define BLUE_INTERRUPT2REG_AESMANENCINT                                    BLUE_INTERRUPT2REG_AESMANENCINT_Msk

