stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    AESLEPRIVPRANDREG    ===================================================== */
#define BLUE_AESLEPRIVPRANDREG_PRAND_Pos                                   (0UL)    /*!<BLUE AESLEPRIVPRANDREG: PRAND (Bit 0) */
#define BLUE_AESLEPRIVPRANDREG_PRAND_Msk                                   (0xffffffUL)   /*!< BLUE AESLEPRIVPRANDREG: PRAND (Bitfield-Mask: 0xffffff) */
#define BLUE_AESLEPRIVPRANDREG_PRAND                                       BLUE_AESLEPRIVPRANDREG_PRAND_Msk
#define BLUE_AESLEPRIVPRANDREG_PRAND_0                                     (0x1U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_1                                     (0x2U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_2                                     (0x4U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_3                                     (0x8U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_4                                     (0x10U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_5                                     (0x20U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_6                                     (0x40U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_7                                     (0x80U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_8                                     (0x100U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_9                                     (0x200U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_10                                    (0x400U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_11                                    (0x800U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_12                                    (0x1000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_13                                    (0x2000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_14                                    (0x4000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_15                                    (0x8000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_16                                    (0x10000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_17                                    (0x20000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_18                                    (0x40000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_19                                    (0x80000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_20                                    (0x100000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_21                                    (0x200000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_22                                    (0x400000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)
#define BLUE_AESLEPRIVPRANDREG_PRAND_23                                    (0x800000U << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)

/* =====================================================    AESLEPRIVCMDREG    ===================================================== */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_Pos                                    (2UL)    /*!<BLUE AESLEPRIVCMDREG: NBKEYS (Bit 2) */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_Msk                                    (0x3fcUL)    /*!< BLUE AESLEPRIVCMDREG: NBKEYS (Bitfield-Mask: 0xff) */
#define BLUE_AESLEPRIVCMDREG_NBKEYS                                        BLUE_AESLEPRIVCMDREG_NBKEYS_Msk
#define BLUE_AESLEPRIVCMDREG_NBKEYS_0                                      (0x1U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_1                                      (0x2U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_2                                      (0x4U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_3                                      (0x8U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_4                                      (0x10U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_5                                      (0x20U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_6                                      (0x40U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_NBKEYS_7                                      (0x80U << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)
#define BLUE_AESLEPRIVCMDREG_INTENA_Pos                                    (1UL)    /*!<BLUE AESLEPRIVCMDREG: INTENA (Bit 1) */
#define BLUE_AESLEPRIVCMDREG_INTENA_Msk                                    (0x2UL)    /*!< BLUE AESLEPRIVCMDREG: INTENA (Bitfield-Mask: 0x01) */
#define BLUE_AESLEPRIVCMDREG_INTENA                                        BLUE_AESLEPRIVCMDREG_INTENA_Msk
#define BLUE_AESLEPRIVCMDREG_START_Pos                                     (0UL)    /*!<BLUE AESLEPRIVCMDREG: START (Bit 0) */
#define BLUE_AESLEPRIVCMDREG_START_Msk                                     (0x1UL)    /*!< BLUE AESLEPRIVCMDREG: START (Bitfield-Mask: 0x01) */
#define BLUE_AESLEPRIVCMDREG_START                                         BLUE_AESLEPRIVCMDREG_START_Msk

/* =====================================================    AESLEPRIVSTATREG    ===================================================== */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos                              (2UL)    /*!<BLUE AESLEPRIVSTATREG: KEYFNDINDEX (Bit 2) */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Msk                              (0x3fcUL)    /*!< BLUE AESLEPRIVSTATREG: KEYFNDINDEX (Bitfield-Mask: 0xff) */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX                                  BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Msk
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_0                                (0x1U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_1                                (0x2U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_2                                (0x4U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_3                                (0x8U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_4                                (0x10U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_5                                (0x20U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_6                                (0x40U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_7                                (0x80U << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)
#define BLUE_AESLEPRIVSTATREG_KEYFND_Pos                                   (1UL)    /*!<BLUE AESLEPRIVSTATREG: KEYFND (Bit 1) */
#define BLUE_AESLEPRIVSTATREG_KEYFND_Msk                                   (0x2UL)    /*!< BLUE AESLEPRIVSTATREG: KEYFND (Bitfield-Mask: 0x01) */
#define BLUE_AESLEPRIVSTATREG_KEYFND                                       BLUE_AESLEPRIVSTATREG_KEYFND_Msk
#define BLUE_AESLEPRIVSTATREG_BUSY_Pos                                     (0UL)    /*!<BLUE AESLEPRIVSTATREG: BUSY (Bit 0) */
#define BLUE_AESLEPRIVSTATREG_BUSY_Msk                                     (0x1UL)    /*!< BLUE AESLEPRIVSTATREG: BUSY (Bitfield-Mask: 0x01) */
#define BLUE_AESLEPRIVSTATREG_BUSY                                         BLUE_AESLEPRIVSTATREG_BUSY_Msk

