stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    WAKEUP_OFFSET_2    ===================================================== */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos                                   (24UL)   /*!<WAKEUP WAKEUP_OFFSET_2: MODE7 (Bit 24) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_Msk                                   (0xff000000UL)   /*!< WAKEUP WAKEUP_OFFSET_2: MODE7 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7                                       WAKEUP_WAKEUP_OFFSET_2_MODE7_Msk
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_0                                     (0x1U << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_1                                     (0x2U << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_2                                     (0x4U << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_3                                     (0x8U << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_4                                     (0x10U << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_5                                     (0x20U << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_6                                     (0x40U << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_7                                     (0x80U << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos                                   (16UL)   /*!<WAKEUP WAKEUP_OFFSET_2: MODE6 (Bit 16) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_Msk                                   (0xff0000UL)   /*!< WAKEUP WAKEUP_OFFSET_2: MODE6 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6                                       WAKEUP_WAKEUP_OFFSET_2_MODE6_Msk
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_0                                     (0x1U << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_1                                     (0x2U << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_2                                     (0x4U << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_3                                     (0x8U << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_4                                     (0x10U << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_5                                     (0x20U << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_6                                     (0x40U << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_7                                     (0x80U << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos                                   (8UL)    /*!<WAKEUP WAKEUP_OFFSET_2: MODE5 (Bit 8) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_Msk                                   (0xff00UL)   /*!< WAKEUP WAKEUP_OFFSET_2: MODE5 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5                                       WAKEUP_WAKEUP_OFFSET_2_MODE5_Msk
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_0                                     (0x1U << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_1                                     (0x2U << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_2                                     (0x4U << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_3                                     (0x8U << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_4                                     (0x10U << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_5                                     (0x20U << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_6                                     (0x40U << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_7                                     (0x80U << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos                                   (0UL)    /*!<WAKEUP WAKEUP_OFFSET_2: MODE4 (Bit 0) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_Msk                                   (0xffUL)   /*!< WAKEUP WAKEUP_OFFSET_2: MODE4 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4                                       WAKEUP_WAKEUP_OFFSET_2_MODE4_Msk
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_0                                     (0x1U << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_1                                     (0x2U << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_2                                     (0x4U << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_3                                     (0x8U << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_4                                     (0x10U << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_5                                     (0x20U << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_6                                     (0x40U << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_7                                     (0x80U << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)

/* =====================================================    ABSOLUTE_TIME    ===================================================== */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos                             (0UL)    /*!<WAKEUP ABSOLUTE_TIME: ABSOLUTE_TIME (Bit 0) */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Msk                             (0xffffffffUL)   /*!< WAKEUP ABSOLUTE_TIME: ABSOLUTE_TIME (Bitfield-Mask: 0xffffffff) */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME                                 WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Msk
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_0                               (0x1U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_1                               (0x2U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_2                               (0x4U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_3                               (0x8U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_4                               (0x10U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_5                               (0x20U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_6                               (0x40U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_7                               (0x80U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_8                               (0x100U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_9                               (0x200U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_10                              (0x400U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_11                              (0x800U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_12                              (0x1000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_13                              (0x2000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_14                              (0x4000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_15                              (0x8000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_16                              (0x10000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_17                              (0x20000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_18                              (0x40000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_19                              (0x80000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_20                              (0x100000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_21                              (0x200000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_22                              (0x400000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_23                              (0x800000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_24                              (0x1000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_25                              (0x2000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_26                              (0x4000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_27                              (0x8000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_28                              (0x10000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_29                              (0x20000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_30                              (0x40000000U << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_31                              (0x80000000UL << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)

