stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    BLE_IRQ_STATUS    ===================================================== */
#define RRM_BLE_IRQ_STATUS_CMD_END_Pos                                     (4UL)    /*!<RRM BLE_IRQ_STATUS: CMD_END (Bit 4) */
#define RRM_BLE_IRQ_STATUS_CMD_END_Msk                                     (0x10UL)   /*!< RRM BLE_IRQ_STATUS: CMD_END (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_STATUS_CMD_END                                         RRM_BLE_IRQ_STATUS_CMD_END_Msk
#define RRM_BLE_IRQ_STATUS_CMD_START_Pos                                   (3UL)    /*!<RRM BLE_IRQ_STATUS: CMD_START (Bit 3) */
#define RRM_BLE_IRQ_STATUS_CMD_START_Msk                                   (0x8UL)    /*!< RRM BLE_IRQ_STATUS: CMD_START (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_STATUS_CMD_START                                       RRM_BLE_IRQ_STATUS_CMD_START_Msk
#define RRM_BLE_IRQ_STATUS_PORT_PREEMPT_Pos                                (2UL)    /*!<RRM BLE_IRQ_STATUS: PORT_PREEMPT (Bit 2) */
#define RRM_BLE_IRQ_STATUS_PORT_PREEMPT_Msk                                (0x4UL)    /*!< RRM BLE_IRQ_STATUS: PORT_PREEMPT (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_STATUS_PORT_PREEMPT                                    RRM_BLE_IRQ_STATUS_PORT_PREEMPT_Msk
#define RRM_BLE_IRQ_STATUS_PORT_RELEASE_Pos                                (1UL)    /*!<RRM BLE_IRQ_STATUS: PORT_RELEASE (Bit 1) */
#define RRM_BLE_IRQ_STATUS_PORT_RELEASE_Msk                                (0x2UL)    /*!< RRM BLE_IRQ_STATUS: PORT_RELEASE (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_STATUS_PORT_RELEASE                                    RRM_BLE_IRQ_STATUS_PORT_RELEASE_Msk
#define RRM_BLE_IRQ_STATUS_PORT_GRANT_Pos                                  (0UL)    /*!<RRM BLE_IRQ_STATUS: PORT_GRANT (Bit 0) */
#define RRM_BLE_IRQ_STATUS_PORT_GRANT_Msk                                  (0x1UL)    /*!< RRM BLE_IRQ_STATUS: PORT_GRANT (Bitfield-Mask: 0x01) */
#define RRM_BLE_IRQ_STATUS_PORT_GRANT                                      RRM_BLE_IRQ_STATUS_PORT_GRANT_Msk

/* =====================================================    VP_CPU_CMD_BUS    ===================================================== */
#define RRM_VP_CPU_CMD_BUS_COMMAND_REQ_Pos                                 (3UL)    /*!<RRM VP_CPU_CMD_BUS: COMMAND_REQ (Bit 3) */
#define RRM_VP_CPU_CMD_BUS_COMMAND_REQ_Msk                                 (0x8UL)    /*!< RRM VP_CPU_CMD_BUS: COMMAND_REQ (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_CMD_BUS_COMMAND_REQ                                     RRM_VP_CPU_CMD_BUS_COMMAND_REQ_Msk
#define RRM_VP_CPU_CMD_BUS_COMMAND_Pos                                     (0UL)    /*!<RRM VP_CPU_CMD_BUS: COMMAND (Bit 0) */
#define RRM_VP_CPU_CMD_BUS_COMMAND_Msk                                     (0x7UL)    /*!< RRM VP_CPU_CMD_BUS: COMMAND (Bitfield-Mask: 0x07) */
#define RRM_VP_CPU_CMD_BUS_COMMAND                                         RRM_VP_CPU_CMD_BUS_COMMAND_Msk
#define RRM_VP_CPU_CMD_BUS_COMMAND_0                                       (0x1U << RRM_VP_CPU_CMD_BUS_COMMAND_Pos)
#define RRM_VP_CPU_CMD_BUS_COMMAND_1                                       (0x2U << RRM_VP_CPU_CMD_BUS_COMMAND_Pos)
#define RRM_VP_CPU_CMD_BUS_COMMAND_2                                       (0x4U << RRM_VP_CPU_CMD_BUS_COMMAND_Pos)

/* =====================================================    VP_CPU_SEMA_BUS    ===================================================== */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PREEMPT_Pos                               (4UL)    /*!<RRM VP_CPU_SEMA_BUS: TAKE_PREEMPT (Bit 4) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PREEMPT_Msk                               (0x10UL)   /*!< RRM VP_CPU_SEMA_BUS: TAKE_PREEMPT (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PREEMPT                                   RRM_VP_CPU_SEMA_BUS_TAKE_PREEMPT_Msk
#define RRM_VP_CPU_SEMA_BUS_TAKE_REQ_Pos                                   (3UL)    /*!<RRM VP_CPU_SEMA_BUS: TAKE_REQ (Bit 3) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_REQ_Msk                                   (0x8UL)    /*!< RRM VP_CPU_SEMA_BUS: TAKE_REQ (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_REQ                                       RRM_VP_CPU_SEMA_BUS_TAKE_REQ_Msk
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos                                  (0UL)    /*!<RRM VP_CPU_SEMA_BUS: TAKE_PRIO (Bit 0) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Msk                                  (0x7UL)    /*!< RRM VP_CPU_SEMA_BUS: TAKE_PRIO (Bitfield-Mask: 0x07) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO                                      RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Msk
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_0                                    (0x1U << RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos)
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_1                                    (0x2U << RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos)
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_2                                    (0x4U << RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos)

/* =====================================================    VP_CPU_IRQ_ENABLE    ===================================================== */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END_Pos                             (4UL)    /*!<RRM VP_CPU_IRQ_ENABLE: PORT_CMD_END (Bit 4) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END_Msk                             (0x10UL)   /*!< RRM VP_CPU_IRQ_ENABLE: PORT_CMD_END (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END                                 RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START_Pos                           (3UL)    /*!<RRM VP_CPU_IRQ_ENABLE: PORT_CMD_START (Bit 3) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START_Msk                           (0x8UL)    /*!< RRM VP_CPU_IRQ_ENABLE: PORT_CMD_START (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START                               RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_PREEMPT_Pos                             (2UL)    /*!<RRM VP_CPU_IRQ_ENABLE: PORT_PREEMPT (Bit 2) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_PREEMPT_Msk                             (0x4UL)    /*!< RRM VP_CPU_IRQ_ENABLE: PORT_PREEMPT (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_PREEMPT                                 RRM_VP_CPU_IRQ_ENABLE_PORT_PREEMPT_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE_Pos                             (1UL)    /*!<RRM VP_CPU_IRQ_ENABLE: PORT_RELEASE (Bit 1) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE_Msk                             (0x2UL)    /*!< RRM VP_CPU_IRQ_ENABLE: PORT_RELEASE (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE                                 RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT_Pos                               (0UL)    /*!<RRM VP_CPU_IRQ_ENABLE: PORT_GRANT (Bit 0) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT_Msk                               (0x1UL)    /*!< RRM VP_CPU_IRQ_ENABLE: PORT_GRANT (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT                                   RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT_Msk

/* =====================================================    VP_CPU_IRQ_STATUS    ===================================================== */
#define RRM_VP_CPU_IRQ_STATUS_CMD_END_Pos                                  (4UL)    /*!<RRM VP_CPU_IRQ_STATUS: CMD_END (Bit 4) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_END_Msk                                  (0x10UL)   /*!< RRM VP_CPU_IRQ_STATUS: CMD_END (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_END                                      RRM_VP_CPU_IRQ_STATUS_CMD_END_Msk
#define RRM_VP_CPU_IRQ_STATUS_CMD_START_Pos                                (3UL)    /*!<RRM VP_CPU_IRQ_STATUS: CMD_START (Bit 3) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_START_Msk                                (0x8UL)    /*!< RRM VP_CPU_IRQ_STATUS: CMD_START (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_START                                    RRM_VP_CPU_IRQ_STATUS_CMD_START_Msk
#define RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT_Pos                             (2UL)    /*!<RRM VP_CPU_IRQ_STATUS: PORT_PREEMPT (Bit 2) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT_Msk                             (0x4UL)    /*!< RRM VP_CPU_IRQ_STATUS: PORT_PREEMPT (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT                                 RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT_Msk
#define RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE_Pos                             (1UL)    /*!<RRM VP_CPU_IRQ_STATUS: PORT_RELEASE (Bit 1) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE_Msk                             (0x2UL)    /*!< RRM VP_CPU_IRQ_STATUS: PORT_RELEASE (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE                                 RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE_Msk
#define RRM_VP_CPU_IRQ_STATUS_PORT_GRANT_Pos                               (0UL)    /*!<RRM VP_CPU_IRQ_STATUS: PORT_GRANT (Bit 0) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_GRANT_Msk                               (0x1UL)    /*!< RRM VP_CPU_IRQ_STATUS: PORT_GRANT (Bitfield-Mask: 0x01) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_GRANT                                   RRM_VP_CPU_IRQ_STATUS_PORT_GRANT_Msk

/* =====================================================    AA0_DIG_USR    ===================================================== */
#define RRM_AA0_DIG_USR_AA_7_0_Pos                                         (0UL)    /*!<RRM AA0_DIG_USR: AA_7_0 (Bit 0) */
#define RRM_AA0_DIG_USR_AA_7_0_Msk                                         (0xffUL)   /*!< RRM AA0_DIG_USR: AA_7_0 (Bitfield-Mask: 0xff) */
#define RRM_AA0_DIG_USR_AA_7_0                                             RRM_AA0_DIG_USR_AA_7_0_Msk
#define RRM_AA0_DIG_USR_AA_7_0_0                                           (0x1U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_1                                           (0x2U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_2                                           (0x4U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_3                                           (0x8U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_4                                           (0x10U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_5                                           (0x20U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_6                                           (0x40U << RRM_AA0_DIG_USR_AA_7_0_Pos)
#define RRM_AA0_DIG_USR_AA_7_0_7                                           (0x80U << RRM_AA0_DIG_USR_AA_7_0_Pos)

/* =====================================================    AA1_DIG_USR    ===================================================== */
#define RRM_AA1_DIG_USR_AA_15_8_Pos                                        (0UL)    /*!<RRM AA1_DIG_USR: AA_15_8 (Bit 0) */
#define RRM_AA1_DIG_USR_AA_15_8_Msk                                        (0xffUL)   /*!< RRM AA1_DIG_USR: AA_15_8 (Bitfield-Mask: 0xff) */
#define RRM_AA1_DIG_USR_AA_15_8                                            RRM_AA1_DIG_USR_AA_15_8_Msk
#define RRM_AA1_DIG_USR_AA_15_8_0                                          (0x1U << RRM_AA1_DIG_USR_AA_15_8_Pos)
#define RRM_AA1_DIG_USR_AA_15_8_1                                          (0x2U << RRM_AA1_DIG_USR_AA_15_8_Pos)
#define RRM_AA1_DIG_USR_AA_15_8_2                                          (0x4U << RRM_AA1_DIG_USR_AA_15_8_Pos)
#define RRM_AA1_DIG_USR_AA_15_8_3                                          (0x8U << RRM_AA1_DIG_USR_AA_15_8_Pos)
#define RRM_AA1_DIG_USR_AA_15_8_4                                          (0x10U << RRM_AA1_DIG_USR_AA_15_8_Pos)
#define RRM_AA1_DIG_USR_AA_15_8_5                                          (0x20U << RRM_AA1_DIG_USR_AA_15_8_Pos)
#define RRM_AA1_DIG_USR_AA_15_8_6                                          (0x40U << RRM_AA1_DIG_USR_AA_15_8_Pos)
#define RRM_AA1_DIG_USR_AA_15_8_7                                          (0x80U << RRM_AA1_DIG_USR_AA_15_8_Pos)

/* =====================================================    AA2_DIG_USR    ===================================================== */
#define RRM_AA2_DIG_USR_AA_23_16_Pos                                       (0UL)    /*!<RRM AA2_DIG_USR: AA_23_16 (Bit 0) */
#define RRM_AA2_DIG_USR_AA_23_16_Msk                                       (0xffUL)   /*!< RRM AA2_DIG_USR: AA_23_16 (Bitfield-Mask: 0xff) */
#define RRM_AA2_DIG_USR_AA_23_16                                           RRM_AA2_DIG_USR_AA_23_16_Msk
#define RRM_AA2_DIG_USR_AA_23_16_0                                         (0x1U << RRM_AA2_DIG_USR_AA_23_16_Pos)
#define RRM_AA2_DIG_USR_AA_23_16_1                                         (0x2U << RRM_AA2_DIG_USR_AA_23_16_Pos)
#define RRM_AA2_DIG_USR_AA_23_16_2                                         (0x4U << RRM_AA2_DIG_USR_AA_23_16_Pos)
#define RRM_AA2_DIG_USR_AA_23_16_3                                         (0x8U << RRM_AA2_DIG_USR_AA_23_16_Pos)
#define RRM_AA2_DIG_USR_AA_23_16_4                                         (0x10U << RRM_AA2_DIG_USR_AA_23_16_Pos)
#define RRM_AA2_DIG_USR_AA_23_16_5                                         (0x20U << RRM_AA2_DIG_USR_AA_23_16_Pos)
#define RRM_AA2_DIG_USR_AA_23_16_6                                         (0x40U << RRM_AA2_DIG_USR_AA_23_16_Pos)
#define RRM_AA2_DIG_USR_AA_23_16_7                                         (0x80U << RRM_AA2_DIG_USR_AA_23_16_Pos)

/* =====================================================    AA3_DIG_USR    ===================================================== */
#define RRM_AA3_DIG_USR_AA_31_24_Pos                                       (0UL)    /*!<RRM AA3_DIG_USR: AA_31_24 (Bit 0) */
#define RRM_AA3_DIG_USR_AA_31_24_Msk                                       (0xffUL)   /*!< RRM AA3_DIG_USR: AA_31_24 (Bitfield-Mask: 0xff) */
#define RRM_AA3_DIG_USR_AA_31_24                                           RRM_AA3_DIG_USR_AA_31_24_Msk
#define RRM_AA3_DIG_USR_AA_31_24_0                                         (0x1U << RRM_AA3_DIG_USR_AA_31_24_Pos)
#define RRM_AA3_DIG_USR_AA_31_24_1                                         (0x2U << RRM_AA3_DIG_USR_AA_31_24_Pos)
#define RRM_AA3_DIG_USR_AA_31_24_2                                         (0x4U << RRM_AA3_DIG_USR_AA_31_24_Pos)
#define RRM_AA3_DIG_USR_AA_31_24_3                                         (0x8U << RRM_AA3_DIG_USR_AA_31_24_Pos)
#define RRM_AA3_DIG_USR_AA_31_24_4                                         (0x10U << RRM_AA3_DIG_USR_AA_31_24_Pos)
#define RRM_AA3_DIG_USR_AA_31_24_5                                         (0x20U << RRM_AA3_DIG_USR_AA_31_24_Pos)
#define RRM_AA3_DIG_USR_AA_31_24_6                                         (0x40U << RRM_AA3_DIG_USR_AA_31_24_Pos)
#define RRM_AA3_DIG_USR_AA_31_24_7                                         (0x80U << RRM_AA3_DIG_USR_AA_31_24_Pos)

