stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    AFC2_DIG_ENG    ===================================================== */
#define RRM_AFC2_DIG_ENG_AFC_ENABLE_Pos                                    (7UL)    /*!<RRM AFC2_DIG_ENG: AFC_ENABLE (Bit 7) */
#define RRM_AFC2_DIG_ENG_AFC_ENABLE_Msk                                    (0x80UL)   /*!< RRM AFC2_DIG_ENG: AFC_ENABLE (Bitfield-Mask: 0x01) */
#define RRM_AFC2_DIG_ENG_AFC_ENABLE                                        RRM_AFC2_DIG_ENG_AFC_ENABLE_Msk
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos                                (0UL)    /*!<RRM AFC2_DIG_ENG: AFC_FREQ_LIMIT (Bit 0) */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Msk                                (0x7fUL)   /*!< RRM AFC2_DIG_ENG: AFC_FREQ_LIMIT (Bitfield-Mask: 0x7f) */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT                                    RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Msk
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_0                                  (0x1U << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_1                                  (0x2U << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_2                                  (0x4U << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_3                                  (0x8U << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_4                                  (0x10U << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_5                                  (0x20U << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_6                                  (0x40U << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)

/* =====================================================    AFC3_DIG_ENG    ===================================================== */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos                              (0UL)    /*!<RRM AFC3_DIG_ENG: AFC_MINMAX_LIMIT (Bit 0) */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Msk                              (0xffUL)   /*!< RRM AFC3_DIG_ENG: AFC_MINMAX_LIMIT (Bitfield-Mask: 0xff) */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT                                  RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Msk
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_0                                (0x1U << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_1                                (0x2U << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_2                                (0x4U << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_3                                (0x8U << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_4                                (0x10U << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_5                                (0x20U << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_6                                (0x40U << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_7                                (0x80U << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)

/* =====================================================    CR0_DIG_ENG    ===================================================== */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos                                 (4UL)    /*!<RRM CR0_DIG_ENG: CR_GAIN_BEFORE (Bit 4) */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Msk                                 (0xf0UL)   /*!< RRM CR0_DIG_ENG: CR_GAIN_BEFORE (Bitfield-Mask: 0x0f) */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE                                     RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Msk
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_0                                   (0x1U << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_1                                   (0x2U << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_2                                   (0x4U << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_3                                   (0x8U << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos                                  (0UL)    /*!<RRM CR0_DIG_ENG: CR_GAIN_AFTER (Bit 0) */
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Msk                                  (0xfUL)    /*!< RRM CR0_DIG_ENG: CR_GAIN_AFTER (Bitfield-Mask: 0x0f) */
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER                                      RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Msk
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_0                                    (0x1U << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_1                                    (0x2U << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_2                                    (0x4U << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_3                                    (0x8U << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)

/* =====================================================    CR0_LR    ===================================================== */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos                                   (4UL)    /*!<RRM CR0_LR: CR_LR_GAIN_BEFORE (Bit 4) */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_Msk                                   (0xf0UL)   /*!< RRM CR0_LR: CR_LR_GAIN_BEFORE (Bitfield-Mask: 0x0f) */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE                                       RRM_CR0_LR_CR_LR_GAIN_BEFORE_Msk
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_0                                     (0x1U << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_1                                     (0x2U << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_2                                     (0x4U << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_3                                     (0x8U << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos                                    (0UL)    /*!<RRM CR0_LR: CR_LR_GAIN_AFTER (Bit 0) */
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_Msk                                    (0xfUL)    /*!< RRM CR0_LR: CR_LR_GAIN_AFTER (Bitfield-Mask: 0x0f) */
#define RRM_CR0_LR_CR_LR_GAIN_AFTER                                        RRM_CR0_LR_CR_LR_GAIN_AFTER_Msk
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_0                                      (0x1U << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_1                                      (0x2U << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_2                                      (0x4U << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_3                                      (0x8U << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)

