stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    AGC2_DIG_ENG    ===================================================== */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos                                (0UL)    /*!<RRM AGC2_DIG_ENG: AGC_THR_LOW_12 (Bit 0) */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Msk                                (0x3fUL)   /*!< RRM AGC2_DIG_ENG: AGC_THR_LOW_12 (Bitfield-Mask: 0x3f) */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12                                    RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Msk
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_0                                  (0x1U << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_1                                  (0x2U << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_2                                  (0x4U << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_3                                  (0x8U << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_4                                  (0x10U << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_5                                  (0x20U << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)

/* =====================================================    AGC3_DIG_ENG    ===================================================== */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos                                  (0UL)    /*!<RRM AGC3_DIG_ENG: AUTOLOCK_THR (Bit 0) */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Msk                                  (0x3fUL)   /*!< RRM AGC3_DIG_ENG: AUTOLOCK_THR (Bitfield-Mask: 0x3f) */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR                                      RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Msk
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_0                                    (0x1U << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_1                                    (0x2U << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_2                                    (0x4U << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_3                                    (0x8U << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_4                                    (0x10U << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_5                                    (0x20U << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)

/* =====================================================    AGC4_DIG_ENG    ===================================================== */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Pos                            (4UL)    /*!<RRM AGC4_DIG_ENG: AGC_HOLD_TIME_SLOW (Bit 4) */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Msk                            (0xf0UL)   /*!< RRM AGC4_DIG_ENG: AGC_HOLD_TIME_SLOW (Bitfield-Mask: 0x0f) */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW                                RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Msk
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_0                              (0x1U << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Pos)
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_1                              (0x2U << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Pos)
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_2                              (0x4U << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Pos)
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_3                              (0x8U << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Pos)
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Pos                            (0UL)    /*!<RRM AGC4_DIG_ENG: AGC_HOLD_TIME_FAST (Bit 0) */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Msk                            (0xfUL)    /*!< RRM AGC4_DIG_ENG: AGC_HOLD_TIME_FAST (Bitfield-Mask: 0x0f) */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST                                RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Msk
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_0                              (0x1U << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Pos)
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_1                              (0x2U << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Pos)
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_2                              (0x4U << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Pos)
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_3                              (0x8U << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Pos)

/* =====================================================    AGC5_DIG_ENG    ===================================================== */
#define RRM_AGC5_DIG_ENG_T_INT_Pos                                         (4UL)    /*!<RRM AGC5_DIG_ENG: T_INT (Bit 4) */
#define RRM_AGC5_DIG_ENG_T_INT_Msk                                         (0xf0UL)   /*!< RRM AGC5_DIG_ENG: T_INT (Bitfield-Mask: 0x0f) */
#define RRM_AGC5_DIG_ENG_T_INT                                             RRM_AGC5_DIG_ENG_T_INT_Msk
#define RRM_AGC5_DIG_ENG_T_INT_0                                           (0x1U << RRM_AGC5_DIG_ENG_T_INT_Pos)
#define RRM_AGC5_DIG_ENG_T_INT_1                                           (0x2U << RRM_AGC5_DIG_ENG_T_INT_Pos)
#define RRM_AGC5_DIG_ENG_T_INT_2                                           (0x4U << RRM_AGC5_DIG_ENG_T_INT_Pos)
#define RRM_AGC5_DIG_ENG_T_INT_3                                           (0x8U << RRM_AGC5_DIG_ENG_T_INT_Pos)
#define RRM_AGC5_DIG_ENG_T_MEAS_Pos                                        (0UL)    /*!<RRM AGC5_DIG_ENG: T_MEAS (Bit 0) */
#define RRM_AGC5_DIG_ENG_T_MEAS_Msk                                        (0xfUL)    /*!< RRM AGC5_DIG_ENG: T_MEAS (Bitfield-Mask: 0x0f) */
#define RRM_AGC5_DIG_ENG_T_MEAS                                            RRM_AGC5_DIG_ENG_T_MEAS_Msk
#define RRM_AGC5_DIG_ENG_T_MEAS_0                                          (0x1U << RRM_AGC5_DIG_ENG_T_MEAS_Pos)
#define RRM_AGC5_DIG_ENG_T_MEAS_1                                          (0x2U << RRM_AGC5_DIG_ENG_T_MEAS_Pos)
#define RRM_AGC5_DIG_ENG_T_MEAS_2                                          (0x4U << RRM_AGC5_DIG_ENG_T_MEAS_Pos)
#define RRM_AGC5_DIG_ENG_T_MEAS_3                                          (0x8U << RRM_AGC5_DIG_ENG_T_MEAS_Pos)

/* =====================================================    AGC6_DIG_ENG    ===================================================== */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos                            (0UL)    /*!<RRM AGC6_DIG_ENG: HOLD_TIME_SEL_10_4 (Bit 0) */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Msk                            (0x7fUL)   /*!< RRM AGC6_DIG_ENG: HOLD_TIME_SEL_10_4 (Bitfield-Mask: 0x7f) */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4                                RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Msk
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_0                              (0x1U << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_1                              (0x2U << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_2                              (0x4U << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_3                              (0x8U << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_4                              (0x10U << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_5                              (0x20U << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_6                              (0x40U << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)

/* =====================================================    AGC7_DIG_ENG    ===================================================== */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos                               (0UL)    /*!<RRM AGC7_DIG_ENG: TH_LOW_SEL_10_4 (Bit 0) */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Msk                               (0x7fUL)   /*!< RRM AGC7_DIG_ENG: TH_LOW_SEL_10_4 (Bitfield-Mask: 0x7f) */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4                                   RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Msk
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_0                                 (0x1U << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_1                                 (0x2U << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_2                                 (0x4U << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_3                                 (0x8U << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_4                                 (0x10U << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_5                                 (0x20U << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_6                                 (0x40U << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)

