stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb05.h
/* =====================================================    AGC8_DIG_ENG    ===================================================== */
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Pos                                (4UL)    /*!<RRM AGC8_DIG_ENG: TH_LOW_SEL_3_0 (Bit 4) */
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Msk                                (0xf0UL)   /*!< RRM AGC8_DIG_ENG: TH_LOW_SEL_3_0 (Bitfield-Mask: 0x0f) */
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0                                    RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Msk
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_0                                  (0x1U << RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Pos)
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_1                                  (0x2U << RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Pos)
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_2                                  (0x4U << RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Pos)
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_3                                  (0x8U << RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Pos)
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Pos                             (0UL)    /*!<RRM AGC8_DIG_ENG: HOLD_TIME_SEL_3_0 (Bit 0) */
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Msk                             (0xfUL)    /*!< RRM AGC8_DIG_ENG: HOLD_TIME_SEL_3_0 (Bitfield-Mask: 0x0f) */
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0                                 RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Msk
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_0                               (0x1U << RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Pos)
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_1                               (0x2U << RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Pos)
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_2                               (0x4U << RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Pos)
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_3                               (0x8U << RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Pos)

/* =====================================================    AGC9_DIG_ENG    ===================================================== */
#define RRM_AGC9_DIG_ENG_MAX_SEQ_Pos                                       (4UL)    /*!<RRM AGC9_DIG_ENG: MAX_SEQ (Bit 4) */
#define RRM_AGC9_DIG_ENG_MAX_SEQ_Msk                                       (0xf0UL)   /*!< RRM AGC9_DIG_ENG: MAX_SEQ (Bitfield-Mask: 0x0f) */
#define RRM_AGC9_DIG_ENG_MAX_SEQ                                           RRM_AGC9_DIG_ENG_MAX_SEQ_Msk
#define RRM_AGC9_DIG_ENG_MAX_SEQ_0                                         (0x1U << RRM_AGC9_DIG_ENG_MAX_SEQ_Pos)
#define RRM_AGC9_DIG_ENG_MAX_SEQ_1                                         (0x2U << RRM_AGC9_DIG_ENG_MAX_SEQ_Pos)
#define RRM_AGC9_DIG_ENG_MAX_SEQ_2                                         (0x4U << RRM_AGC9_DIG_ENG_MAX_SEQ_Pos)
#define RRM_AGC9_DIG_ENG_MAX_SEQ_3                                         (0x8U << RRM_AGC9_DIG_ENG_MAX_SEQ_Pos)
#define RRM_AGC9_DIG_ENG_START_SEQ_Pos                                     (0UL)    /*!<RRM AGC9_DIG_ENG: START_SEQ (Bit 0) */
#define RRM_AGC9_DIG_ENG_START_SEQ_Msk                                     (0xfUL)    /*!< RRM AGC9_DIG_ENG: START_SEQ (Bitfield-Mask: 0x0f) */
#define RRM_AGC9_DIG_ENG_START_SEQ                                         RRM_AGC9_DIG_ENG_START_SEQ_Msk
#define RRM_AGC9_DIG_ENG_START_SEQ_0                                       (0x1U << RRM_AGC9_DIG_ENG_START_SEQ_Pos)
#define RRM_AGC9_DIG_ENG_START_SEQ_1                                       (0x2U << RRM_AGC9_DIG_ENG_START_SEQ_Pos)
#define RRM_AGC9_DIG_ENG_START_SEQ_2                                       (0x4U << RRM_AGC9_DIG_ENG_START_SEQ_Pos)
#define RRM_AGC9_DIG_ENG_START_SEQ_3                                       (0x8U << RRM_AGC9_DIG_ENG_START_SEQ_Pos)

/* =====================================================    AGC10_DIG_ENG    ===================================================== */
#define RRM_AGC10_DIG_ENG_ATT_0_Pos                                        (0UL)    /*!<RRM AGC10_DIG_ENG: ATT_0 (Bit 0) */
#define RRM_AGC10_DIG_ENG_ATT_0_Msk                                        (0x3fUL)   /*!< RRM AGC10_DIG_ENG: ATT_0 (Bitfield-Mask: 0x3f) */
#define RRM_AGC10_DIG_ENG_ATT_0                                            RRM_AGC10_DIG_ENG_ATT_0_Msk
#define RRM_AGC10_DIG_ENG_ATT_0_0                                          (0x1U << RRM_AGC10_DIG_ENG_ATT_0_Pos)
#define RRM_AGC10_DIG_ENG_ATT_0_1                                          (0x2U << RRM_AGC10_DIG_ENG_ATT_0_Pos)
#define RRM_AGC10_DIG_ENG_ATT_0_2                                          (0x4U << RRM_AGC10_DIG_ENG_ATT_0_Pos)
#define RRM_AGC10_DIG_ENG_ATT_0_3                                          (0x8U << RRM_AGC10_DIG_ENG_ATT_0_Pos)
#define RRM_AGC10_DIG_ENG_ATT_0_4                                          (0x10U << RRM_AGC10_DIG_ENG_ATT_0_Pos)
#define RRM_AGC10_DIG_ENG_ATT_0_5                                          (0x20U << RRM_AGC10_DIG_ENG_ATT_0_Pos)

/* =====================================================    AGC11_DIG_ENG    ===================================================== */
#define RRM_AGC11_DIG_ENG_ATT_1_Pos                                        (0UL)    /*!<RRM AGC11_DIG_ENG: ATT_1 (Bit 0) */
#define RRM_AGC11_DIG_ENG_ATT_1_Msk                                        (0x3fUL)   /*!< RRM AGC11_DIG_ENG: ATT_1 (Bitfield-Mask: 0x3f) */
#define RRM_AGC11_DIG_ENG_ATT_1                                            RRM_AGC11_DIG_ENG_ATT_1_Msk
#define RRM_AGC11_DIG_ENG_ATT_1_0                                          (0x1U << RRM_AGC11_DIG_ENG_ATT_1_Pos)
#define RRM_AGC11_DIG_ENG_ATT_1_1                                          (0x2U << RRM_AGC11_DIG_ENG_ATT_1_Pos)
#define RRM_AGC11_DIG_ENG_ATT_1_2                                          (0x4U << RRM_AGC11_DIG_ENG_ATT_1_Pos)
#define RRM_AGC11_DIG_ENG_ATT_1_3                                          (0x8U << RRM_AGC11_DIG_ENG_ATT_1_Pos)
#define RRM_AGC11_DIG_ENG_ATT_1_4                                          (0x10U << RRM_AGC11_DIG_ENG_ATT_1_Pos)
#define RRM_AGC11_DIG_ENG_ATT_1_5                                          (0x20U << RRM_AGC11_DIG_ENG_ATT_1_Pos)

/* =====================================================    AGC12_DIG_ENG    ===================================================== */
#define RRM_AGC12_DIG_ENG_ATT_2_Pos                                        (0UL)    /*!<RRM AGC12_DIG_ENG: ATT_2 (Bit 0) */
#define RRM_AGC12_DIG_ENG_ATT_2_Msk                                        (0x3fUL)   /*!< RRM AGC12_DIG_ENG: ATT_2 (Bitfield-Mask: 0x3f) */
#define RRM_AGC12_DIG_ENG_ATT_2                                            RRM_AGC12_DIG_ENG_ATT_2_Msk
#define RRM_AGC12_DIG_ENG_ATT_2_0                                          (0x1U << RRM_AGC12_DIG_ENG_ATT_2_Pos)
#define RRM_AGC12_DIG_ENG_ATT_2_1                                          (0x2U << RRM_AGC12_DIG_ENG_ATT_2_Pos)
#define RRM_AGC12_DIG_ENG_ATT_2_2                                          (0x4U << RRM_AGC12_DIG_ENG_ATT_2_Pos)
#define RRM_AGC12_DIG_ENG_ATT_2_3                                          (0x8U << RRM_AGC12_DIG_ENG_ATT_2_Pos)
#define RRM_AGC12_DIG_ENG_ATT_2_4                                          (0x10U << RRM_AGC12_DIG_ENG_ATT_2_Pos)
#define RRM_AGC12_DIG_ENG_ATT_2_5                                          (0x20U << RRM_AGC12_DIG_ENG_ATT_2_Pos)

/* =====================================================    AGC13_DIG_ENG    ===================================================== */
#define RRM_AGC13_DIG_ENG_ATT_3_Pos                                        (0UL)    /*!<RRM AGC13_DIG_ENG: ATT_3 (Bit 0) */
#define RRM_AGC13_DIG_ENG_ATT_3_Msk                                        (0x3fUL)   /*!< RRM AGC13_DIG_ENG: ATT_3 (Bitfield-Mask: 0x3f) */
#define RRM_AGC13_DIG_ENG_ATT_3                                            RRM_AGC13_DIG_ENG_ATT_3_Msk
#define RRM_AGC13_DIG_ENG_ATT_3_0                                          (0x1U << RRM_AGC13_DIG_ENG_ATT_3_Pos)
#define RRM_AGC13_DIG_ENG_ATT_3_1                                          (0x2U << RRM_AGC13_DIG_ENG_ATT_3_Pos)
#define RRM_AGC13_DIG_ENG_ATT_3_2                                          (0x4U << RRM_AGC13_DIG_ENG_ATT_3_Pos)
#define RRM_AGC13_DIG_ENG_ATT_3_3                                          (0x8U << RRM_AGC13_DIG_ENG_ATT_3_Pos)
#define RRM_AGC13_DIG_ENG_ATT_3_4                                          (0x10U << RRM_AGC13_DIG_ENG_ATT_3_Pos)
#define RRM_AGC13_DIG_ENG_ATT_3_5                                          (0x20U << RRM_AGC13_DIG_ENG_ATT_3_Pos)

/* =====================================================    AGC14_DIG_ENG    ===================================================== */
#define RRM_AGC14_DIG_ENG_ATT_4_Pos                                        (0UL)    /*!<RRM AGC14_DIG_ENG: ATT_4 (Bit 0) */
#define RRM_AGC14_DIG_ENG_ATT_4_Msk                                        (0x3fUL)   /*!< RRM AGC14_DIG_ENG: ATT_4 (Bitfield-Mask: 0x3f) */
#define RRM_AGC14_DIG_ENG_ATT_4                                            RRM_AGC14_DIG_ENG_ATT_4_Msk
#define RRM_AGC14_DIG_ENG_ATT_4_0                                          (0x1U << RRM_AGC14_DIG_ENG_ATT_4_Pos)
#define RRM_AGC14_DIG_ENG_ATT_4_1                                          (0x2U << RRM_AGC14_DIG_ENG_ATT_4_Pos)
#define RRM_AGC14_DIG_ENG_ATT_4_2                                          (0x4U << RRM_AGC14_DIG_ENG_ATT_4_Pos)
#define RRM_AGC14_DIG_ENG_ATT_4_3                                          (0x8U << RRM_AGC14_DIG_ENG_ATT_4_Pos)
#define RRM_AGC14_DIG_ENG_ATT_4_4                                          (0x10U << RRM_AGC14_DIG_ENG_ATT_4_Pos)
#define RRM_AGC14_DIG_ENG_ATT_4_5                                          (0x20U << RRM_AGC14_DIG_ENG_ATT_4_Pos)

/* =====================================================    AGC15_DIG_ENG    ===================================================== */
#define RRM_AGC15_DIG_ENG_ATT_5_Pos                                        (0UL)    /*!<RRM AGC15_DIG_ENG: ATT_5 (Bit 0) */
#define RRM_AGC15_DIG_ENG_ATT_5_Msk                                        (0x3fUL)   /*!< RRM AGC15_DIG_ENG: ATT_5 (Bitfield-Mask: 0x3f) */
#define RRM_AGC15_DIG_ENG_ATT_5                                            RRM_AGC15_DIG_ENG_ATT_5_Msk
#define RRM_AGC15_DIG_ENG_ATT_5_0                                          (0x1U << RRM_AGC15_DIG_ENG_ATT_5_Pos)
#define RRM_AGC15_DIG_ENG_ATT_5_1                                          (0x2U << RRM_AGC15_DIG_ENG_ATT_5_Pos)
#define RRM_AGC15_DIG_ENG_ATT_5_2                                          (0x4U << RRM_AGC15_DIG_ENG_ATT_5_Pos)
#define RRM_AGC15_DIG_ENG_ATT_5_3                                          (0x8U << RRM_AGC15_DIG_ENG_ATT_5_Pos)
#define RRM_AGC15_DIG_ENG_ATT_5_4                                          (0x10U << RRM_AGC15_DIG_ENG_ATT_5_Pos)
#define RRM_AGC15_DIG_ENG_ATT_5_5                                          (0x20U << RRM_AGC15_DIG_ENG_ATT_5_Pos)

/* =====================================================    AGC16_DIG_ENG    ===================================================== */
#define RRM_AGC16_DIG_ENG_ATT_6_Pos                                        (0UL)    /*!<RRM AGC16_DIG_ENG: ATT_6 (Bit 0) */
#define RRM_AGC16_DIG_ENG_ATT_6_Msk                                        (0x3fUL)   /*!< RRM AGC16_DIG_ENG: ATT_6 (Bitfield-Mask: 0x3f) */
#define RRM_AGC16_DIG_ENG_ATT_6                                            RRM_AGC16_DIG_ENG_ATT_6_Msk
#define RRM_AGC16_DIG_ENG_ATT_6_0                                          (0x1U << RRM_AGC16_DIG_ENG_ATT_6_Pos)
#define RRM_AGC16_DIG_ENG_ATT_6_1                                          (0x2U << RRM_AGC16_DIG_ENG_ATT_6_Pos)
#define RRM_AGC16_DIG_ENG_ATT_6_2                                          (0x4U << RRM_AGC16_DIG_ENG_ATT_6_Pos)
#define RRM_AGC16_DIG_ENG_ATT_6_3                                          (0x8U << RRM_AGC16_DIG_ENG_ATT_6_Pos)
#define RRM_AGC16_DIG_ENG_ATT_6_4                                          (0x10U << RRM_AGC16_DIG_ENG_ATT_6_Pos)
#define RRM_AGC16_DIG_ENG_ATT_6_5                                          (0x20U << RRM_AGC16_DIG_ENG_ATT_6_Pos)

/* =====================================================    AGC17_DIG_ENG    ===================================================== */
#define RRM_AGC17_DIG_ENG_ATT_7_Pos                                        (0UL)    /*!<RRM AGC17_DIG_ENG: ATT_7 (Bit 0) */
#define RRM_AGC17_DIG_ENG_ATT_7_Msk                                        (0x3fUL)   /*!< RRM AGC17_DIG_ENG: ATT_7 (Bitfield-Mask: 0x3f) */
#define RRM_AGC17_DIG_ENG_ATT_7                                            RRM_AGC17_DIG_ENG_ATT_7_Msk
#define RRM_AGC17_DIG_ENG_ATT_7_0                                          (0x1U << RRM_AGC17_DIG_ENG_ATT_7_Pos)
#define RRM_AGC17_DIG_ENG_ATT_7_1                                          (0x2U << RRM_AGC17_DIG_ENG_ATT_7_Pos)
#define RRM_AGC17_DIG_ENG_ATT_7_2                                          (0x4U << RRM_AGC17_DIG_ENG_ATT_7_Pos)
#define RRM_AGC17_DIG_ENG_ATT_7_3                                          (0x8U << RRM_AGC17_DIG_ENG_ATT_7_Pos)
#define RRM_AGC17_DIG_ENG_ATT_7_4                                          (0x10U << RRM_AGC17_DIG_ENG_ATT_7_Pos)
#define RRM_AGC17_DIG_ENG_ATT_7_5                                          (0x20U << RRM_AGC17_DIG_ENG_ATT_7_Pos)

/* =====================================================    AGC18_DIG_ENG    ===================================================== */
#define RRM_AGC18_DIG_ENG_ATT_8_Pos                                        (0UL)    /*!<RRM AGC18_DIG_ENG: ATT_8 (Bit 0) */
#define RRM_AGC18_DIG_ENG_ATT_8_Msk                                        (0x3fUL)   /*!< RRM AGC18_DIG_ENG: ATT_8 (Bitfield-Mask: 0x3f) */
#define RRM_AGC18_DIG_ENG_ATT_8                                            RRM_AGC18_DIG_ENG_ATT_8_Msk
#define RRM_AGC18_DIG_ENG_ATT_8_0                                          (0x1U << RRM_AGC18_DIG_ENG_ATT_8_Pos)
#define RRM_AGC18_DIG_ENG_ATT_8_1                                          (0x2U << RRM_AGC18_DIG_ENG_ATT_8_Pos)
#define RRM_AGC18_DIG_ENG_ATT_8_2                                          (0x4U << RRM_AGC18_DIG_ENG_ATT_8_Pos)
#define RRM_AGC18_DIG_ENG_ATT_8_3                                          (0x8U << RRM_AGC18_DIG_ENG_ATT_8_Pos)
#define RRM_AGC18_DIG_ENG_ATT_8_4                                          (0x10U << RRM_AGC18_DIG_ENG_ATT_8_Pos)
#define RRM_AGC18_DIG_ENG_ATT_8_5                                          (0x20U << RRM_AGC18_DIG_ENG_ATT_8_Pos)

/* =====================================================    AGC19_DIG_ENG    ===================================================== */
#define RRM_AGC19_DIG_ENG_ATT_9_Pos                                        (0UL)    /*!<RRM AGC19_DIG_ENG: ATT_9 (Bit 0) */
#define RRM_AGC19_DIG_ENG_ATT_9_Msk                                        (0x3fUL)   /*!< RRM AGC19_DIG_ENG: ATT_9 (Bitfield-Mask: 0x3f) */
#define RRM_AGC19_DIG_ENG_ATT_9                                            RRM_AGC19_DIG_ENG_ATT_9_Msk
#define RRM_AGC19_DIG_ENG_ATT_9_0                                          (0x1U << RRM_AGC19_DIG_ENG_ATT_9_Pos)
#define RRM_AGC19_DIG_ENG_ATT_9_1                                          (0x2U << RRM_AGC19_DIG_ENG_ATT_9_Pos)
#define RRM_AGC19_DIG_ENG_ATT_9_2                                          (0x4U << RRM_AGC19_DIG_ENG_ATT_9_Pos)
#define RRM_AGC19_DIG_ENG_ATT_9_3                                          (0x8U << RRM_AGC19_DIG_ENG_ATT_9_Pos)
#define RRM_AGC19_DIG_ENG_ATT_9_4                                          (0x10U << RRM_AGC19_DIG_ENG_ATT_9_Pos)
#define RRM_AGC19_DIG_ENG_ATT_9_5                                          (0x20U << RRM_AGC19_DIG_ENG_ATT_9_Pos)

/* =====================================================    AGC20_DIG_ENG    ===================================================== */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos                                  (0UL)    /*!<RRM AGC20_DIG_ENG: I_GAIN_COMP (Bit 0) */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_Msk                                  (0xffUL)   /*!< RRM AGC20_DIG_ENG: I_GAIN_COMP (Bitfield-Mask: 0xff) */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP                                      RRM_AGC20_DIG_ENG_I_GAIN_COMP_Msk
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_0                                    (0x1U << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_1                                    (0x2U << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_2                                    (0x4U << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_3                                    (0x8U << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_4                                    (0x10U << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_5                                    (0x20U << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_6                                    (0x40U << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_7                                    (0x80U << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)

/* =====================================================    RXADC_HW_TRIM_OUT    ===================================================== */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos                     (3UL)    /*!<RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_Q (Bit 3) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Msk                     (0x38UL)   /*!< RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_Q (Bitfield-Mask: 0x07) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q                         RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Msk
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_0                       (0x1U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_1                       (0x2U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_2                       (0x4U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos                     (0UL)    /*!<RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_I (Bit 0) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Msk                     (0x7UL)    /*!< RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_I (Bitfield-Mask: 0x07) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I                         RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Msk
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_0                       (0x1U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_1                       (0x2U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_2                       (0x4U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos)

/* =====================================================    CBIAS0_HW_TRIM_OUT     ===================================================== */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos                     (4UL)    /*!<RRM CBIAS0_HW_TRIM_OUT : HW_CBIAS_IPTAT_TRIM (Bit 4) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Msk                     (0xf0UL)   /*!< RRM CBIAS0_HW_TRIM_OUT : HW_CBIAS_IPTAT_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM                         RRM_CBIAS0_HW_TRIM_OUT _HW_CBIAS_IPTAT_TRIM_Msk
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_0                       (0x1U << RRM_CBIAS0_HW_TRIM_OUT _HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_1                       (0x2U << RRM_CBIAS0_HW_TRIM_OUT _HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_2                       (0x4U << RRM_CBIAS0_HW_TRIM_OUT _HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_3                       (0x8U << RRM_CBIAS0_HW_TRIM_OUT _HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos                     (0UL)    /*!<RRM CBIAS0_HW_TRIM_OUT : HW_CBIAS_IBIAS_TRIM (Bit 0) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Msk                     (0xfUL)    /*!< RRM CBIAS0_HW_TRIM_OUT : HW_CBIAS_IBIAS_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM                         RRM_CBIAS0_HW_TRIM_OUT _HW_CBIAS_IBIAS_TRIM_Msk
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_0                       (0x1U << RRM_CBIAS0_HW_TRIM_OUT _HW_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_1                       (0x2U << RRM_CBIAS0_HW_TRIM_OUT _HW_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_2                       (0x4U << RRM_CBIAS0_HW_TRIM_OUT _HW_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_3                       (0x8U << RRM_CBIAS0_HW_TRIM_OUT _HW_CBIAS_IBIAS_TRIM_Pos)

/* =====================================================    AGC_HW_TRIM_OUT    ===================================================== */
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos                       (1UL)    /*!<RRM AGC_HW_TRIM_OUT: HW_AGC_ANTENNAE_TRIM (Bit 1) */
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Msk                       (0xeUL)    /*!< RRM AGC_HW_TRIM_OUT: HW_AGC_ANTENNAE_TRIM (Bitfield-Mask: 0x07) */
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM                           RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Msk
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_0                         (0x1U << RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos)
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_1                         (0x2U << RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos)
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_2                         (0x4U << RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos)

